#include "thprac_games.h"
#include "thprac_utils.h"
#include <metrohash128.h>

#include <d3d9.h> // for rendering cards in AdvOpt

namespace THPrac {
namespace TH18 {
#define play_sound_centered(id) asm_call<0x476BE0, Stdcall>(id, UNUSED_DWORD)

    // MSVC WILL generate suboptimal code here if I don't hand-write my own assembly here
#pragma warning(push)
#pragma warning(disable : 4100)
    __declspec(naked) void __fastcall globals_assign_hooked(uint32_t* glob1, void*, uint32_t* glob2)
    {
        __asm {
            push esi
            mov esi, [ecx+0x20]
            push [esp+0x8]
            mov eax, 0x417A60
            call eax
            mov [eax+0x20], esi
            pop esi
            ret 0x4
        }
    }
#pragma warning(pop)

    enum sound_id : uint32_t {
        SND_INVALID = 16,
    };

    enum addrs {
        CARD_DESC_LIST = 0x4c53c0,
        MENU_INPUT = 0x4ca21c,
        STAGE_NUM = 0x4cccdc,
        ABILITY_MANAGER_PTR = 0x4cf298,
        ABILITY_SHOP_PTR = 0x4cf2a4,
        ASCII_MANAGER_PTR = 0x4cf2ac,
        BULLET_MANAGER_PTR = 0x4cf2bc,
        MUKADE_ADDR = 0x4cf2d4,
        GAME_THREAD_PTR = 0x4cf2e4,
        ITEM_MANAGER_PTR = 0x4cf2ec,
        PAUSE_MENU_PTR = 0x4cf40c,
        PLAYER_PTR = 0x4cf410,
        SCOREFILE_MANAGER_PTR = 0x4cf41c,
        ANM_MANAGER_PTR = 0x51f65c,
        WINDOW_PTR = 0x568c30,
    };
    
    enum cards {
        KOZUCHI = 42,
        KANAME,
        MOON,
        MIKOFLASH,
        VAMPIRE,
        SUN,
        LILY,
        BASSDRUM,
        PSYCO,
        CYLINDER = 52,
        RICEBALL,
        MUKADE
    };

    struct Thread {
        void* vtable; //0x0
        void* thread; //0x4
        uint32_t tid; //0x8
        int32_t __bool_c; //0xc
        int32_t __bool_10; //0x10
        HINSTANCE* phModule; //0x14
        char filler_24[0x4]; //0x18
    };

    struct CardBase {
        struct VTableCard* vtable; //0x0
        int32_t card_id; //0x4
        int32_t array_index___plus_1_i_think; //0x8
        ThList<CardBase> list_node; //0xc
        int32_t anm_id_for_ingame_effect; //0x1c
        Timer recharge_timer; //0x20
        Timer _recharge_timer; //0x34
        int32_t recharge_time; //0x48
        struct TableCardData* table_entry; //0x4c
        int32_t flags; //0x50
    };

    struct CardLily : public CardBase {
        int32_t count; //0x54
    };

    struct TableCardData {
        char* internal_name;
        uint32_t card_id;
        uint32_t in_trial;
        uint32_t category;
        uint32_t price;
        uint32_t weight;
        uint32_t appearance_condition;
        uint32_t allow_duplicates;
        uint32_t menu_equippable;
        uint32_t default_unlock;
        uint32_t __not_basic_resource;
        uint32_t sprite_large;
        uint32_t sprite_small;
    };

    struct AbilityManager {
        char filler_0[0x4]; //0x0
        struct UpdateFunc* on_tick; //0x4
        struct UpdateFunc* on_draw; //0x8
        struct AnmLoaded* ability_anm; //0xc
        struct AnmLoaded* abcard_anm; //0x10
        struct AnmLoaded* abmenu_anm; //0x14
        ThList<CardBase> card_list_head; //0x18
        int32_t num_total_cards; //0x28
        int32_t num_active_cards; //0x2c
        int32_t num_equipment_cards; //0x30
        int32_t num_passive_cards; //0x34
        CardBase* selected_active_card; //0x38
        int32_t __id_3c; //0x3c
        char filler_64[0xc]; //0x40 - 0x48
        int32_t __id_4c; //0x4c
        char filler_80[0x4]; //0x50
        int32_t flags; //0x54
        int32_t __array_1[0x100]; //0x58
        int32_t __array_2[0x100]; //0x458
        int32_t __array_3[0x100]; //0x858
        char filler_3160[0xc]; //0xc58
        int32_t __created_ability_txt; //0xc64
        struct Thread __thread; //0xc68
        int32_t bought_flags[0x40]; //0xc84
    };

    struct AnmSprite { //size 0x44
        char _pad0[0x8];
        int32_t __index_8; // 0x8
        char _pad1[0x38];
    };

    struct AnmImage { //size 0x18
        LPDIRECT3DTEXTURE9 d3d_texture; //0x0
        void* file; // 0x4
        int32_t file_size; // 0x8
        uint32_t bytes_per_pixel; // 0xC
        void* entry; // 0x10
        uint32_t flags; // 0x14
    };

    struct AnmLoaded { //size 0x13c
        char _pad0[0x11c];
        AnmSprite* sprites; //0x11c
        char _pad1[0x4];
        AnmImage* images; //0x124
        char _pad2[0x14];
    };

    struct AnmManager {
        char _pad0[0x312072c];
        AnmLoaded* loaded_anm_files[33]; //0x312072c
    };

    using std::pair;
    struct THPracParam {
        int32_t mode;
        int32_t stage;
        int32_t section;
        int32_t phase;

        int64_t score;
        int32_t life;
        int32_t life_fragment;
        int32_t bomb;
        int32_t bomb_fragment;
        int32_t power;
        int32_t funds;

        int32_t kozuchi;
        int32_t kaname;
        int32_t moon;
        int32_t mikoflash;
        int32_t vampire;
        int32_t sun;
        int32_t lily_count;
        int32_t lily_cycle;
        int32_t lily_cd;
        int32_t bassdrum;
        int32_t psyco;
        int32_t cylinder;
        int32_t riceball;
        int32_t mukade;

        bool dlg;

        bool _playLock = false;
        void Reset()
        {
            memset(this, 0, sizeof(THPracParam));
