#include "thprac_games.h"
#include "thprac_utils.h"
#include <format>
#include <math.h>

#include "utils/wininternal.h"
#include <fstream>

#pragma warning(disable : 4706)
// WTF Microsoft
#undef hyper

namespace THPrac {
    bool g_show_att_hitbox = false;
namespace TH20 {
    using std::pair;
    constexpr int32_t stoneGaugeInitialValue[] = { 1100, 1200, 1300, 1400, 1400, 1400, 1400 }; 
    
    class TH20Save {
        SINGLETON(TH20Save)
    public:
        enum TH20SpellState {
            Capture = 0,
            Attempt = 1,
            Timeout = 2
        };
        const int cSaveVersion = 1;
        const char* cSaveFile = "score20pyra.dat";
        struct PyraState
        {
            DWORD lastPyraAddr = 0;
            bool isInPyra = false;
            int lastPyraSpellId = 0;
            bool isPyraFailed = false;
            bool isPyraTimeout = false;
            void Reset()
            {
                lastPyraAddr = 0;
                isInPyra = false;
                lastPyraSpellId = 0;
                isPyraFailed = false;
                isPyraTimeout = false;
            }
        }pyraState;
    static int32_t GetPyraSpellId(int stage, int is_stage4_mid_1,int stone1)
    {
        if (is_stage4_mid_1)
            return 0;
        if (stage == 4)
            if (stone1 >= 0 && stone1 < 8)//stone1 = 01234567
                return stone1 / 2 + 1; //1 2 3 4
        return 5;
    }
    static int32_t GetPlayerType(int main_player_type, int stone1)
    {
        return main_player_type * 8 + stone1;
    }
    public:
        struct Save {
            int32_t ScHistory[6][5][16][3] = { 0 }; // (st4 0 A B C D /st5 pyra), diff, playertype, [capture/attempt/timeout]
            int32_t ScHistoryPrac[6][5][16][3] = { 0 };
        };
        Save saveCurrent;
        Save saveTotal;
        bool isSaveLoaded;
        TH20Save()
        {
            saveCurrent = { 0 };
            saveTotal = { 0 };
            isSaveLoaded = false;
            LoadSave();
        }

    public:
        void LoadSave()
        {
            if (isSaveLoaded)
                return;
            PushCurrentDirectory(L"%appdata%\\ShanghaiAlice\\th20");
            auto fs_new = ::std::fstream(cSaveFile, ::std::ios::in | ::std::ios::binary);
            if (fs_new.is_open()) {
                isSaveLoaded = true;
                int version = 1;
                fs_new.read((char*)&version, sizeof(version));
                switch (version) {
                default:
                case 1:
                    fs_new.read((char*)(&saveTotal), sizeof(saveTotal));
                    break;
                }
                fs_new.close();
            }
            PopCurrentDirectory();
        }

        void SaveSave()
        {
            PushCurrentDirectory(L"%appdata%\\ShanghaiAlice\\th20");
            auto fs = ::std::fstream(cSaveFile, ::std::ios::out | ::std::ios::binary);
            if (fs.is_open()) {
                fs.write((char*)(&cSaveVersion), sizeof(cSaveVersion));
                fs.write((char*)(&saveTotal), sizeof(saveTotal));
                fs.close();
            }
            PopCurrentDirectory();
        }

         void AddTimeout(int spell_id, byte diff, byte player_type,bool isPrac)
        {
            LoadSave();
            if (isPrac)
            {
                saveTotal.ScHistoryPrac[spell_id][diff][player_type][2]++;
                saveCurrent.ScHistoryPrac[spell_id][diff][player_type][2]++;
            }
            else
            {
                saveTotal.ScHistory[spell_id][diff][player_type][2]++;
                saveCurrent.ScHistory[spell_id][diff][player_type][2]++;
            }
            SaveSave();
        }

        void AddAttempt(int spell_id, int diff, int player_type, bool isPrac)
        {
            LoadSave();
            if (isPrac) {
                saveTotal.ScHistoryPrac[spell_id][diff][player_type][1]++;
                saveCurrent.ScHistoryPrac[spell_id][diff][player_type][1]++;
            } else {
                saveTotal.ScHistory[spell_id][diff][player_type][1]++;
                saveCurrent.ScHistory[spell_id][diff][player_type][1]++;
            }
            SaveSave();
        }

        void AddCapture(int spell_id, int diff, int player_type, bool isPrac)
        {
            LoadSave();
            if (isPrac) {
                saveTotal.ScHistoryPrac[spell_id][diff][player_type][0]++;
                saveCurrent.ScHistoryPrac[spell_id][diff][player_type][0]++;
            } else {
                saveTotal.ScHistory[spell_id][diff][player_type][0]++;
                saveCurrent.ScHistory[spell_id][diff][player_type][0]++;
            }
            SaveSave();
        }

        int GetTotalSpellCardCount(int spell_id, int diff, int player_type, TH20SpellState state)
        {
            return saveTotal.ScHistory[spell_id][diff][player_type][state];
        }
        int GetCurrentSpellCardCount(int spell_id, int diff, int player_type, TH20SpellState state)
        {
            return saveCurrent.ScHistory[spell_id][diff][player_type][state];
        }

        void ShowDetail()
        {
            static bool is_comb = false;
            static bool is_prac = false;
            static bool is_total = true;
            static int32_t schistory_tot[6][5][16][3]; 
            static int32_t schistory_cur[6][5][16][3]; 

            const char* players_strs[2] = { S(THPRAC_IGI_PL_Reimu), S(THPRAC_IGI_PL_Marisa) };
            const char* spells_str[6] = {
                S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID1),
                S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID2R),
                S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID2B),
                S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID2Y),
                S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID2G),
                S(THPRAC_INGAMEINFO_20_PYRAMID_ST5_MID1),
            };
            const ImVec4 r = { 1.0f, 0.5f, 0.5f, 1.0f };
            const ImVec4 g = { 0.5f, 1.0f, 0.5f, 1.0f };
            const ImVec4 b = { 0.5f, 0.75f, 1.0f, 1.0f };
            const ImVec4 y = { 1.0f, 1.0f, 0.3f, 1.0f };
            const ImVec4 w = { 1.0f, 1.0f, 1.0f, 1.0f };
            const ImVec4 p = { 1.0f, 0.5f, 1.0f, 1.0f };
            const ImVec4 rk = { 0.9f, 0.2f, 0.2f, 1.0f };
            const ImVec4 gk = { 0.2f, 0.7f, 0.2f, 1.0f };
            const ImVec4 bk = { 0.1f, 0.5f, 1.0f, 1.0f };
            const ImVec4 yk = { 0.8f, 0.8f, 0.2f, 1.0f };
            const ImVec4 spells_colors[] = { p, r, b, y, g, w };
            const ImVec4 stones_colors[] = { r, rk, b, bk, y, yk, g, gk, w };

            if (ImGui::Checkbox(S(THPRAC_INGAMEINFO_20_TOTAL_CAPTURE_RATE), &is_total)) {
                is_comb = is_prac = false;
            }
            ImGui::SameLine();
            if (ImGui::Checkbox(S(THPRAC_INGAMEINFO_20_COMBAT_CAPTURE_RATE), &is_comb))
            {
                is_prac = is_total = false;
            }
            ImGui::SameLine();
            if (ImGui::Checkbox(S(THPRAC_INGAMEINFO_20_PRAC_CAPTURE_RATE), &is_prac)) {
                is_comb = is_total = false;
            }
            for (int i = 0; i < 6; i++)
                for (int j = 0; j < 5; j++)
                    for (int k = 0; k < 16; k++)
                        for (int l = 0; l < 3; l++) {
                            if (is_comb)
                            {
                                schistory_tot[i][j][k][l] = saveTotal.ScHistory[i][j][k][l];
                                schistory_cur[i][j][k][l] = saveCurrent.ScHistory[i][j][k][l];
                            } else if (is_prac)
                            {
                                schistory_tot[i][j][k][l] = saveTotal.ScHistoryPrac[i][j][k][l];
                                schistory_cur[i][j][k][l] = saveCurrent.ScHistoryPrac[i][j][k][l];
                            }
                            else
                            {
                                schistory_tot[i][j][k][l] = saveTotal.ScHistory[i][j][k][l] + saveTotal.ScHistoryPrac[i][j][k][l];
                                schistory_cur[i][j][k][l] = saveCurrent.ScHistory[i][j][k][l] + saveCurrent.ScHistoryPrac[i][j][k][l];
                            }
                        }
            
            ImGui::BeginTabBar("Detail Spell");
            {
                const char* tabs_diff_strs[4] = { S(THPRAC_IGI_DIFF_E), S(THPRAC_IGI_DIFF_N), S(THPRAC_IGI_DIFF_H), S(THPRAC_IGI_DIFF_L)};
                for (int diff = 0; diff < 4; diff++) {
                    if (ImGui::BeginTabItem(tabs_diff_strs[diff])) {
                        ImGui::BeginTabBar("Player Type");
                        for (int pl = 0; pl < 2; pl++) {
                            if (ImGui::BeginTabItem(players_strs[pl])) {
                                // spell capture
                                ImGui::BeginTable(std::format("{}{}sptable", tabs_diff_strs[diff], players_strs[pl]).c_str(), 6, ImGuiTableFlags_::ImGuiTableFlags_Resizable);
                                ImGui::TableSetupColumn(S(THPRAC_INGAMEINFO_06_SPELL_NAME), 0, 45.0f);
                                ImGui::TableSetupColumn(S(THPRAC_INGAMEINFO_20_STONE_NAME), 0, 50.0f);
                                ImGui::TableSetupColumn(S(THPRAC_INGAMEINFO_20_PASS_TOT), 0, 30.0f);
                                ImGui::TableSetupColumn(S(THPRAC_INGAMEINFO_06_TIMEOUT_TOT), 0, 24.0f);
                                ImGui::TableSetupColumn(S(THPRAC_INGAMEINFO_20_PASS_CUR), 0, 30.0f);
                                ImGui::TableSetupColumn(S(THPRAC_INGAMEINFO_06_TIMEOUT_CUR), 0, 24.0f);
                                ImGui::TableHeadersRow();

                                for (int stone = 0; stone < 8; stone++)
                                {
                                    for (int spell = 0; spell < 6; spell++) {
                                        int plstone_type = GetPlayerType(pl, stone);
                                        if (schistory_tot[spell][diff][plstone_type][TH20Save::Attempt] == 0)
                                        {
                                            if ((spell >= 1 && spell <= 4) && (stone / 2 != spell - 1)) // mismatched spell/stone
                                                continue;
                                        }
                                        ImVec4 spell_color = spells_colors[spell];
                                        ImVec4 stone_color = stones_colors[stone];
                                        if (spell == 5 && g_adv_igi_options.th12_chromatic_ufo) // st5 pyra
                                        {
                                            static float t = 0;
                                            t += 0.003f;
                                            if (t >= 1.0f)
                                                t = 0.0f;
                                            float rr, gg, bb;
                                            ImGui::ColorConvertHSVtoRGB(fmodf(t, 1.0f), 0.4f, 1.0f, rr, gg, bb);
                                            spell_color = { rr, gg, bb, 1.0f };
                                            stone_color.x = rr * 0.6f + stone_color.x * 0.4f;
                                            stone_color.y = gg * 0.6f + stone_color.y * 0.4f;
                                            stone_color.z = bb * 0.6f + stone_color.z * 0.4f;
                                        }

                                        ImGui::TableNextRow();
                                        ImGui::TableNextColumn();

                                        ImGui::TextColored(spell_color, "%s", spells_str[spell]);
                                        ImGui::TableNextColumn();

                                        if (Gui::LocaleGet() == Gui::LOCALE_EN_US)
                                            ImGui::TextColored(stone_color, "%s\"%s\"", S(IGI_PL_20_SUB[stone]), S(IGI_PL_20_SUB_FULL[stone]));
                                        else
                                            ImGui::TextColored(stone_color, "%s「%s」", S(IGI_PL_20_SUB[stone]), S(IGI_PL_20_SUB_FULL[stone]));
                                        ImGui::TableNextColumn();
                                        
                                        // (st4 0 A B C D /st5 pyra), diff, playertype, [capture/attempt/timeout]
                                        ImGui::TextColored(stone_color, "%d/%d(%.1f%%)", 
                                            schistory_tot[spell][diff][plstone_type][TH20Save::Capture] + schistory_tot[spell][diff][plstone_type][TH20Save::Timeout],
                                            schistory_tot[spell][diff][plstone_type][TH20Save::Attempt],
                                            ((float)(schistory_tot[spell][diff][plstone_type][TH20Save::Capture] + schistory_tot[spell][diff][plstone_type][TH20Save::Timeout]) / std::fmaxf(1.0f, ((float)schistory_tot[spell][diff][plstone_type][TH20Save::Attempt])) * 100.0f));
                                        ImGui::TableNextColumn();

                                        ImGui::TextColored(stone_color, "%d", schistory_tot[spell][diff][plstone_type][TH20Save::Timeout]);
                                        ImGui::TableNextColumn();

                                        ImGui::TextColored(stone_color, "%d/%d(%.1f%%)",
                                            schistory_cur[spell][diff][plstone_type][TH20Save::Capture] + schistory_cur[spell][diff][plstone_type][TH20Save::Timeout],
                                            schistory_cur[spell][diff][plstone_type][TH20Save::Attempt],
                                            ((float)(schistory_cur[spell][diff][plstone_type][TH20Save::Capture] + schistory_cur[spell][diff][plstone_type][TH20Save::Timeout]) / std::fmaxf(1.0f, ((float)schistory_cur[spell][diff][plstone_type][TH20Save::Attempt])) * 100.0f));
                                        ImGui::TableNextColumn();

                                        ImGui::TextColored(stone_color, "%d", schistory_cur[spell][diff][plstone_type][TH20Save::Timeout]);
                                        ImGui::TableNextColumn();
                                    }
                                    ImGui::TableNextRow();
                                    ImGui::TableNextColumn();
                                    ImGui::NewLine();
                                }
                                ImGui::EndTable();
                                ImGui::EndTabItem();
                            }
                        }
                        ImGui::EndTabBar();
                        ImGui::EndTabItem();
                    }
                }
            }
            ImGui::EndTabBar();
        }
    };


    enum rel_addrs {
        DIFFICULTY = 0x1b0a60,
        WINDOW_PTR = 0x1b6758,
        GAME_SIDE0 = 0x1ba568,
        PLAYER_PTR = GAME_SIDE0 + 0x4,
        DMG_SRC_MGR_PTR = GAME_SIDE0 + 0x28,
        MODEFLAGS = GAME_SIDE0 + 0x6c,
        STAGE_NUM = GAME_SIDE0 + 0x88 + 0x1f4,
        GAME_THREAD_PTR = 0x1ba828,
        TRANSITION_STG_PTR = 0x1c06a0,
        REPLAY_MGR_PTR = 0x1c60fc,
        ENM_STONE_MGR_PTR = 0x1c6118,
        MAIN_MENU_PTR = 0x1c6124,
        SET_TIMER_FUNC = 0x23520,
        ADD_TIMER_FUNC = 0x297A0,
        ALLOCATE_DMG_SRC_FUNC = 0xc0e60,
        DELETE_DMG_SRC_FUNC = 0xc1f30,
    };

    struct AnmVM {
        char gap0[0x20];
        uint32_t sprite_id; // 0x20
        uint32_t script_id; // 0x24
        char gap1[0x48];
        Float2 sprite_dims; // 0x70
        char gap2[0x420];
        uint16_t anm_draw_mode; // 0x498, contains both render & blend mode
    };

     struct PlayerDamageSource {
        PlayerDamageSource* self_ptr; // 0x0
        PlayerDamageSource* list_next; // 0x4
        PlayerDamageSource* list_prev; // 0x8
        void* iterable_list; // 0xc
        void* cur_iterator; // 0x10
        uint32_t flags; // 0x14
        float radius; // 0x18
        float unknown_float_1c; // 0x1c
        float radius_delta; // 0x20
        float angle; // 0x24
        float angular_velocity; // 0x28
        Float2 size; // 0x2c
        Float2 position; // 0x34
        char otherMotionData[0x40]; // 0x3c
        Timer20 duration; // 0x7c
        uint32_t id; // 0x8c
        uint32_t player_bullet_id; // 0x90
        int32_t damage; // 0x94
        int32_t damage_dealt; // 0x98
        int32_t damage_cap; // 0x9c
        int32_t hit_freq; // 0xa0
        char variousUnknowns[0x18]; // 0xa4
        uint32_t side_index; // 0xbc
        void* game_side; // 0xc0
    };

        struct GlobalsSide {
        uint64_t score; // 0x0
        int32_t character; // 0x8
        int32_t story_stone; // 0xc
        int32_t narrow_shot_stone; // 0x10
        int32_t wide_shot_stone; // 0x14
        int32_t assist_stone; // 0x18
        int32_t story_stone_raw; // 0x1c
        int32_t narrow_shot_stone_raw; // 0x20
        int32_t wide_shot_stone_raw; // 0x24
        int32_t assist_stone_raw; // 0x28
        uint8_t story_stone_copy; // 0x2c
        uint8_t narrow_shot_stone_copy; // 0x2d
        uint8_t wide_shot_stone_copy; // 0x2e
        uint8_t assist_stone_copy; // 0x2f
        int32_t current_power; // 0x30
        int32_t max_power; // 0x34
        int32_t power_per_level; // 0x38
        int32_t __int_3C; // 0x3c
        int32_t piv_base; // 0x40
        int32_t piv; // 0x44
        int32_t piv_divisor; // 0x48
        int32_t hyper_meter; // 0x4c
        int32_t hyper_meter_max; // 0x50
        int32_t hyper_duration; // 0x54
        int32_t __dword_58; // 0x58
        int32_t summon_meter; // 0x5c
        int32_t summon_meter_max; // 0x60
        int32_t stone_priority_red; // 0x64
        int32_t stone_priority_blue; // 0x68
        int32_t stone_priority_yellow; // 0x6c
        int32_t stone_priority_green; // 0x70
        int32_t stone_level_red; // 0x74
        int32_t stone_level_blue; // 0x78
        int32_t stone_level_yellow; // 0x7c
        int32_t stone_level_green; // 0x80
        int32_t stone_enemy_count_red; // 0x84
        int32_t stone_enemy_count_blue; // 0x88
        int32_t stone_enemy_count_yellow; // 0x8c
        int32_t stone_enemy_count_green; // 0x90
        int32_t stone_enemy_count_total; // 0x94
        int32_t next_stone_enemy_type; // 0x98
        char unknowns_9c[0xc]; // 0x9c
        int32_t g2_passive_factor; // 0xa8
        char unknowns_ac[0xc]; // 0xac
        int32_t life_stocks; // 0xb8
        int32_t life_stock_max; // 0xbc
        int32_t life_fragments; // 0xc0
        int32_t lives_added; // 0xc4
        int32_t __int_C8; // 0xc8
        int32_t bomb_stocks; // 0xcc
        int32_t bomb_fragments; // 0xd0
        int32_t bomb_stocks_for_new_life; // 0xd4
        int32_t bomb_stock_max; // 0xd8
        int32_t __chapter_total; // 0xdc
        int32_t __chapter_destroy; // 0xe0
        int32_t graze; // 0xe4
        int32_t hitbox_scale; // 0xe8
        uint32_t side_index; // 0xec
    };


    // maps original resolution option id to the corresponding height of the default (sprite -1) anm sprite
    // used for Nina Sp4 desync fix
    float defaultSpriteHeights[4] = { 0.0f, 6.0f, 10.0f, 14.0f };

    struct THPracParam {
        int32_t mode;
        int32_t stage;
        int32_t section;
        int32_t phase;

        int64_t score;
        int32_t life;
        int32_t life_fragment;
        int32_t bomb;
        int32_t bomb_fragment;
        int32_t cycle;
        int32_t power;
        int32_t value;

        float hyper;
        float stone;
        bool hyperActive;
        bool stoneActive;

        int32_t stoneMax;
        int32_t levelR;
        int32_t priorityR;
        int32_t levelB;
        int32_t priorityB;
        int32_t levelY;
        int32_t priorityY;
        int32_t levelG;
        int32_t priorityG;

        int32_t reimuR2Timer[7];
        int32_t passiveMeterTimer[7];
        int32_t yellow2CycleAngle[7][4];
        int32_t yellow2CycleTimer[7][4];
        float resolutionSpriteHeight;
        std::vector<PlayerDamageSource> rogueDmgSrcs[7];
        uint32_t nextDmgID[7];
        std::vector<uint32_t> expStoneColors[7];
        bool dlg;

        bool _playLock = false;
        void Reset()
        {
            for (size_t st = 0; st < elementsof(rogueDmgSrcs); ++st)
                rogueDmgSrcs[st].clear();

            memset(this, 0, sizeof(THPracParam));
        }
        bool ReadJson(std::string& json)
        {
            ParseJson();

            ForceJsonValue(game, "th20");
            GetJsonValue(mode);
            GetJsonValue(stage);
            GetJsonValue(section);
            GetJsonValue(phase);
            GetJsonValueEx(dlg, Bool);

            GetJsonValue(score);
            GetJsonValue(life);
            GetJsonValue(life_fragment);
            GetJsonValue(bomb);
            GetJsonValue(bomb_fragment);
            GetJsonValue(cycle);
            GetJsonValue(power);
            GetJsonValue(value);

            GetJsonValue(hyper);
            GetJsonValue(stone);
            GetJsonValueEx(hyperActive, Bool);
            GetJsonValueEx(stoneActive, Bool);
            GetJsonValue(stoneMax);
            GetJsonValue(levelR);
            GetJsonValue(priorityR);
            GetJsonValue(levelB);
            GetJsonValue(priorityB);
            GetJsonValue(levelY);
            GetJsonValue(priorityY);
            GetJsonValue(levelG);
            GetJsonValue(priorityG);
            GetJsonArray(reimuR2Timer, elementsof(reimuR2Timer));
            GetJsonArray(passiveMeterTimer, elementsof(passiveMeterTimer));
            GetJsonArray2D(yellow2CycleAngle, elementsof(yellow2CycleAngle), elementsof(yellow2CycleAngle[0]));
            GetJsonArray2D(yellow2CycleTimer, elementsof(yellow2CycleTimer), elementsof(yellow2CycleTimer[0]));
            GetJsonValue(resolutionSpriteHeight);

            // deserializing damage source data (for Y1 lingering hitbox desync fix)
            GetJsonVectorArray(rogueDmgSrcs, {
                if (!el.IsArray() || el.Size() * sizeof(int32_t) != sizeof(PlayerDamageSource))
                    return std::nullopt;

                PlayerDamageSource dmgSrc {};
                int32_t* p = (int32_t*)&dmgSrc;
                for (rapidjson::SizeType i = 0; i < el.Size(); i++)
                    p[i] = el[i].GetInt();

                return dmgSrc;
            });
            GetJsonArray(nextDmgID, elementsof(nextDmgID));
            GetJsonVectorArray(expStoneColors, {
                if (el.IsArray())
                    return std::nullopt;
                return (uint32_t)el.GetInt();
            });

            return true;
        }
        std::string GetJson()
        {
            if (mode == 0) { // vanilla run mode
                CreateJson();

                AddJsonValueEx(version, GetVersionStr(), jalloc);
                AddJsonValueEx(game, "th20", jalloc);
                AddJsonValue(mode);

                AddJsonArray(reimuR2Timer, elementsof(reimuR2Timer));
                AddJsonArray(passiveMeterTimer, elementsof(passiveMeterTimer));
                AddJsonValue(resolutionSpriteHeight);

                // lotta zeros we don't always need to store
                GlobalsSide* globals = (GlobalsSide*)RVA(GAME_SIDE0 + 0x88);
                if (globals->narrow_shot_stone_raw == 5 || globals->wide_shot_stone_raw == 5 ||
                    (globals->story_stone_raw == 5 && (globals->narrow_shot_stone_copy || globals->wide_shot_stone_copy))) {
                    AddJsonArray2D(yellow2CycleAngle, elementsof(yellow2CycleAngle), elementsof(yellow2CycleAngle[0]));
                    AddJsonArray2D(yellow2CycleTimer, elementsof(yellow2CycleTimer), elementsof(yellow2CycleTimer[0]));
                }

                AddJsonVectorArray(rogueDmgSrcs, {
                    rapidjson::Value dmgSrcArray(rapidjson::kArrayType);

                    int32_t* p = (int32_t*)&el;
                    size_t count = sizeof(PlayerDamageSource) / sizeof(int32_t);
                    for (size_t i = 0; i < count; ++i)
                        dmgSrcArray.PushBack(p[i], jalloc);

                    return dmgSrcArray;
                });
                AddJsonArray(nextDmgID, elementsof(nextDmgID));

                AddJsonVectorArray(expStoneColors, {
                    return rapidjson::Value(el);
                });

                ReturnJson();
            } else { // thprac mode
                CreateJson();

                AddJsonValueEx(version, GetVersionStr(), jalloc);
                AddJsonValueEx(game, "th20", jalloc);
                AddJsonValue(mode);
                AddJsonValue(stage);
                if (section)
                    AddJsonValue(section);
                if (phase)
                    AddJsonValue(phase);
                if (dlg)
                    AddJsonValue(dlg);

                AddJsonValue(score);
                AddJsonValue(life);
                AddJsonValue(life_fragment);
                AddJsonValue(bomb);
                AddJsonValue(bomb_fragment);
                AddJsonValue(cycle);
                AddJsonValue(stoneMax);
                AddJsonValue(power);
                AddJsonValue(value);

                AddJsonValue(hyper);
                AddJsonValue(hyperActive);
                AddJsonValue(stoneActive);
                AddJsonValue(stone);
                AddJsonValue(levelR);
                AddJsonValue(priorityR);
                AddJsonValue(levelB);
                AddJsonValue(priorityB);
                AddJsonValue(levelY);
                AddJsonValue(priorityY);
                AddJsonValue(levelG);
                AddJsonValue(priorityG);
                AddJsonValue(resolutionSpriteHeight);

                ReturnJson();
            }

            CreateJson();
            jalloc; // Dummy usage to silence C4189
            ReturnJson();
        }

        bool HasTransitionSyncData(int st = 0)
        {
            if (!st) { // default: has ANY data (these can be 0 on st1 but not on later stages)
                st = 1;
                for (size_t s = st; s < 6; ++s)
                    if (yellow2CycleTimer[s][0] || rogueDmgSrcs[s].size())
                        return true;
            }

            // timer values should be non-zero on 1st stage transition if recorded
            // y2 opt timer checked per stage because you could otherwise make an adversarial replay (dont bring out y2 options until later stage)
            return reimuR2Timer[st] || passiveMeterTimer[st] || yellow2CycleTimer[st][0] || rogueDmgSrcs[st].size();
        }

        bool HasExpStoneData()
        {
            for (auto& stgData : expStoneColors)
                if (stgData.size())
                    return true;

            return false;
        }

        void MarkExpStoneFixed(bool extra)
        {
            if (HasExpStoneData())
                return;
            expStoneColors[extra ? 0 : 6].push_back(999999);
        }
    };
    THPracParam thPracParam {};
    uint32_t replayStones[4] {};
    size_t stage_expired_summon_cnt = 0;

    constexpr uint32_t minTimerOffsets[5] = { 39, 40, 49, 43, 44 }; // # of anm entries loaded on transition (max 1 per frame)
    constexpr uint32_t TIMER_OFFSET_MAX = 300;
    size_t advExtraFixResOpt = 0;

    bool advFixTimerOffsets = false;
    int32_t deterministicTransitionR2TimerVal = 0; // used to normalize variable delay before stage transition
    Gui::GuiDrag<uint32_t, ImGuiDataType_S32> advFixedTimerOffsets[5] = {
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st2", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 },
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st3", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 },
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st4", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 },
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st5", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 },
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st6", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 }
    };
    std::vector<uint32_t> advExpStoneColors[7];
    THPracParam repFixParamCopy {};

    void ResetFixToolsSharedState()
    {
        // reset replay fix tools shared state iff replay selection changed or went back to title screen
        // shared state & not AdvWnd public members to avoid ugly forward declaration
        advExtraFixResOpt = 0;
        advFixTimerOffsets = false;
        deterministicTransitionR2TimerVal = 0;
        for (auto& off : advFixedTimerOffsets) *off = 0;
        for (auto& c : advExpStoneColors) c.clear();
        repFixParamCopy.Reset();
    }

    class THGuiPrac : public Gui::GameGuiWnd {
        THGuiPrac() noexcept
        {
            *mMode = 1;
            *mLife = 7;
            *mBomb = 7;
            *mPower = 400;
            *mValue = 0;
            *mLevelR = 1;
            *mLevelB = 1;
            *mLevelY = 1;
            *mLevelG = 1;
            *mPriorityR = 0;
            *mPriorityB = 0;
            *mPriorityY = 0;
            *mPriorityG = 0;

            SetFade(0.8f, 0.1f);
            SetStyle(ImGuiStyleVar_WindowRounding, 0.0f);
            SetStyle(ImGuiStyleVar_WindowBorderSize, 0.0f);
            OnLocaleChange();
        }
        SINGLETON(THGuiPrac)

    public:
        __declspec(noinline) void State(int state)
        {
            switch (state) {
            case 0:
                break;
            case 1:
                mDifficulty = GetMemContent(RVA(DIFFICULTY));
                SetFade(0.8f, 0.1f);
                Open();
                thPracParam.Reset();
            case 2:
                break;
            case 3:
                SetFade(0.8f, 0.1f);
                Close();

                // Fill Param
                thPracParam.mode = *mMode;
                thPracParam.stage = *mStage;
                thPracParam.section = CalcSection();
                thPracParam.phase = SpellPhase() ? *mPhase : 0;
                if (SectionHasDlg(thPracParam.section))
                    thPracParam.dlg = *mDlg;

                thPracParam.score = *mScore;
                thPracParam.life = *mLife;
                thPracParam.life_fragment = *mLifeFragment;
                thPracParam.bomb = *mBomb;
                thPracParam.bomb_fragment = *mBombFragment;
                thPracParam.cycle = *mCycle;
                thPracParam.stoneMax = std::min(5000, stoneGaugeInitialValue[*mStage] + *stoneMax * 150);
                thPracParam.power = *mPower;
                thPracParam.value = *mValue;

                thPracParam.hyper = *mHyper / 10000.0f;
                thPracParam.stone = *mStone / 10000.0f;
                thPracParam.levelR = *mLevelR - 1;
                thPracParam.priorityR = *mPriorityR;
                thPracParam.levelB = *mLevelB - 1;
                thPracParam.priorityB = *mPriorityB;
                thPracParam.levelG = *mLevelG - 1;
                thPracParam.priorityG = *mPriorityG;
                thPracParam.levelY = *mLevelY - 1;
                thPracParam.priorityY = *mPriorityY;

                thPracParam.hyperActive = *mHyperActive;
                thPracParam.stoneActive = *mStoneActive;
                break;
            case 4:
                Close();
                break;
            default:
                break;
            }
        }

    protected:
        virtual void OnLocaleChange() override
        {
            SetTitle(S(TH_MENU));
            switch (Gui::LocaleGet()) {
            case Gui::LOCALE_ZH_CN:
                SetSizeRel(0.55f, 0.7f);
                SetPosRel(0.215f, 0.18f);
                // SetSizeRel(0.65f, 0.81f);
                // SetPosRel(0.20f, 0.1f);
                SetItemWidthRel(-0.15f);
                SetAutoSpacing(true);
                break;
            case Gui::LOCALE_EN_US:
                SetSizeRel(0.6f, 0.79f);
                SetPosRel(0.215f, 0.18f);
                SetItemWidthRel(-0.100f);
                SetAutoSpacing(true);
                break;
            case Gui::LOCALE_JA_JP:
                SetSizeRel(0.56f, 0.81f);
                SetPosRel(0.230f, 0.18f);
                SetItemWidthRel(-0.150f);
                SetAutoSpacing(true);
                break;
            default:
                break;
            }
        }
        virtual void OnContentUpdate() override
        {
            ImGui::TextUnformatted(S(TH_MENU));
            ImGui::Separator();

            PracticeMenu();
        }
        const th_glossary_t* SpellPhase()
        {
            auto section = CalcSection();
            if (section == TH20_ST7_BOSS17)
                return TH20_SPELL_PHASE_TIMEOUT;
            if (section == TH20_ST6_BOSS12 || section == TH20_ST7_BOSS18) {
                return TH_SPELL_PHASE2;
            }
            return nullptr;
        }
        void PracticeMenu()
        {
            mMode();
            if (mStage())
                *mSection = *mChapter = 0;
            if (*mMode == 1) {
                int mbs = -1;
                if (*mStage == 2 || *mStage == 5) { // Counting from 0
                    mbs = 2;
                    if (*mWarp == 2)
                        *mWarp = 0;
                }

                if (mWarp(mbs))
                    *mSection = *mChapter = *mPhase = 0;
                if (*mWarp) {
                    SectionWidget();
                    mPhase(TH_PHASE, SpellPhase());
                }

                mLife();
                mLifeFragment();
                mBomb();
                mBombFragment();
                auto power_str = std::to_string((float)(*mPower) / 100.0f).substr(0, 4);
                mPower(power_str.c_str());
                auto value_str = std::format("{:.2f}", (float)(*mValue) / 5000.0f);
                mValue(value_str.c_str());

                
                ImGui::Columns(2, 0, false);
                if (mHyperActive()) {
                    if (*mHyperActive && *mHyper == 0)
                        *mHyper = 10000;
                    if (!*mHyperActive && *mHyper == 10000)
                        *mHyper = 0;
                }
                ImGui::NextColumn();
                if (mStoneActive()) {
                    if (*mStoneActive && *mStone == 0)
                        *mStone = 10000;
                    if (!*mStoneActive && *mStone == 10000)
                        *mStone = 0;
                }
                ImGui::Columns(1);

                mHyper(std::format("{:.2f} %%", (float)(*mHyper) / 100.0f).c_str());
                mStone(std::format("{:.2f} %%", (float)(*mStone) / 100.0f).c_str());
                stoneMax(std::format("{}({})", std::min(5000, stoneGaugeInitialValue[*mStage] + *stoneMax * 150), *stoneMax).c_str());
                ImGui::SameLine();
                HelpMarker(S(TH20_STONE_GAUGE_INITIAL_DESC));
                mCycle();

                ImGui::Columns(2);
                auto& style = ImGui::GetStyle();
                auto old_col = style.Colors[ImGuiCol_SliderGrab];
                auto old_col_active = style.Colors[ImGuiCol_SliderGrabActive];

                style.Colors[ImGuiCol_SliderGrab] = ImVec4(1.0f, 0.25f, 0.25f, 0.40f);
                style.Colors[ImGuiCol_SliderGrabActive] = ImVec4(1.0f, 0.25f, 0.25f, 1.0f);
                mLevelR();
                ImGui::NextColumn();
                mPriorityR();

                style.Colors[ImGuiCol_SliderGrab] = ImVec4(0.25f, 0.25f, 1.0f, 0.40f);
                style.Colors[ImGuiCol_SliderGrabActive] = ImVec4(0.25f, 0.25f, 1.0f, 1.0f);
                ImGui::NextColumn();
                mLevelB();
                ImGui::NextColumn();
                mPriorityB();

                style.Colors[ImGuiCol_SliderGrab] = ImVec4(1.0f, 1.0f, 0.25f, 0.40f);
                style.Colors[ImGuiCol_SliderGrabActive] = ImVec4(1.0f, 1.0f, 0.25f, 1.0f);
                ImGui::NextColumn();
                mLevelY();
                ImGui::NextColumn();
                mPriorityY();

                style.Colors[ImGuiCol_SliderGrab] = ImVec4(0.25f, 1.0f, 0.25f, 0.40f);
                style.Colors[ImGuiCol_SliderGrabActive] = ImVec4(0.0f, 1.0f, 0.25f, 1.0f);
                ImGui::NextColumn();
                mLevelG();
                ImGui::NextColumn();
                mPriorityG();

                style.Colors[ImGuiCol_SliderGrab] = old_col;
                style.Colors[ImGuiCol_SliderGrabActive] = old_col_active;
                ImGui::Columns(1);

                mScore();
                mScore.RoundDown(10);
            }
        }
        int CalcSection()
        {
            int chapterId = 0;
            switch (*mWarp) {
            case 1: // Chapter
                // Chapter Id = 10000 + Stage * 100 + Section
                chapterId += (*mStage + 1) * 100;
                chapterId += *mChapter;
                chapterId += 10000; // Base of chapter ID is 1000.
                return chapterId;
                break;
            case 2:
            case 3: // Mid boss & End boss
                return th_sections_cba[*mStage][*mWarp - 2][*mSection];
                break;
            case 4:
            case 5: // Non-spell & Spellcard
                return th_sections_cbt[*mStage][*mWarp - 4][*mSection];
                break;
            default:
                return 0;
                break;
            }
        }
        bool SectionHasDlg(int32_t section)
        {
            switch (section) {
            case TH20_ST1_BOSS1:
            case TH20_ST2_BOSS1:
            case TH20_ST3_BOSS1:
            case TH20_ST4_BOSS1:
            case TH20_ST5_BOSS1:
            case TH20_ST6_BOSS1:
            case TH20_ST6_BOSS5:
            case TH20_ST6_BOSS9:
            case TH20_ST7_BOSS1:
            case TH20_ST7_MID1:
                return true;
            default:
                return false;
            }
        }
        void SectionWidget()
        {
            static char chapterStr[256] {};
            auto& chapterCounts = mChapterSetup[*mStage];

            switch (*mWarp) {
            case 1: // Chapter
                mChapter.SetBound(1, chapterCounts[0] + chapterCounts[1]);

                if (chapterCounts[1] == 0 && chapterCounts[0] != 0) {
                    sprintf_s(chapterStr, S(TH_STAGE_PORTION_N), *mChapter);
                } else if (*mChapter <= chapterCounts[0]) {
                    sprintf_s(chapterStr, S(TH_STAGE_PORTION_1), *mChapter);
                } else {
                    sprintf_s(chapterStr, S(TH_STAGE_PORTION_2), *mChapter - chapterCounts[0]);
                };

                mChapter(chapterStr);
                break;
            case 2:
            case 3: // Mid boss & End boss
                if (mSection(TH_WARP_SELECT[*mWarp],
                        th_sections_cba[*mStage][*mWarp - 2],
                        th_sections_str[::THPrac::Gui::LocaleGet()][mDifficulty]))
                    *mPhase = 0;
                if (SectionHasDlg(th_sections_cba[*mStage][*mWarp - 2][*mSection]))
                    mDlg();
                break;
            case 4:
            case 5: // Non-spell & Spellcard
                if (mSection(TH_WARP_SELECT[*mWarp],
                        th_sections_cbt[*mStage][*mWarp - 4],
                         th_sections_str[::THPrac::Gui::LocaleGet()][mDifficulty]))
                    *mPhase = 0;
                if (SectionHasDlg(th_sections_cbt[*mStage][*mWarp - 4][*mSection]))
                    mDlg();
                break;
            default:
                break;
            }
        }

        Gui::GuiCombo mMode { TH_MODE, TH_MODE_SELECT };
        Gui::GuiCombo mStage { TH_STAGE, TH_STAGE_SELECT };
        Gui::GuiCombo mWarp { TH_WARP, TH_WARP_SELECT };
        Gui::GuiCombo mSection { TH_MODE };
        Gui::GuiCombo mPhase { TH_PHASE };
        Gui::GuiCheckBox mDlg { TH_DLG };

        Gui::GuiSlider<int, ImGuiDataType_S32> mChapter { TH_CHAPTER, 0, 0 };
        Gui::GuiDrag<int64_t, ImGuiDataType_S64> mScore { TH_SCORE, 0, 9999999990, 10, 100000000 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mLife { TH_LIFE, 0, 7 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mLifeFragment { TH_LIFE_FRAGMENT, 0, 2 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mBomb { TH_BOMB, 0, 7 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mBombFragment { TH_BOMB_FRAGMENT, 0, 2 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mPower { TH_POWER, 100, 400 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mValue { TH_VALUE, 0, 1000000 };

        Gui::GuiCheckBox mHyperActive { TH20_HYPER_ACTIVE };
        Gui::GuiCheckBox mStoneActive { TH20_STONE_ACTIVE };
        Gui::GuiSlider<int, ImGuiDataType_S32> mHyper { TH20_HYPER, 0, 10000, 1, 1000 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mStone { TH20_STONE_GAUGE, 0, 10000, 1, 1000 };
        Gui::GuiSlider<int, ImGuiDataType_S32> stoneMax { TH20_STONE_GAUGE_INITIAL, 0, 26 };
        Gui::GuiCombo mCycle { TH20_CYCLE, TH20_CYCLE_LIST };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mLevelR { TH20_STONE_LEVEL_R, 1, 5 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mPriorityR { TH20_STONE_PRIORITY_R, 0, 1000 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mLevelB { TH20_STONE_LEVEL_B, 1, 5 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mPriorityB { TH20_STONE_PRIORITY_B, 0, 1000 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mLevelY { TH20_STONE_LEVEL_Y, 1, 5 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mPriorityY { TH20_STONE_PRIORITY_Y, 0, 1000 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mLevelG { TH20_STONE_LEVEL_G, 1, 5 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mPriorityG { TH20_STONE_PRIORITY_G, 0, 1000 };

        int mChapterSetup[7][2] {
            { 3, 2 },
            { 3, 3 },
            { 4, 3 },
            { 5, 2 },
            { 5, 2 },
            { 4, 1 },
            { 4, 3 },
        };

        int mDifficulty = 0;
    };
    class THGuiRep : public Gui::GameGuiWnd {
        THGuiRep() noexcept
        {
            wchar_t appdata[MAX_PATH];
            GetEnvironmentVariableW(L"APPDATA", appdata, MAX_PATH);
            mAppdataPath = appdata;
        }
        SINGLETON(THGuiRep)

    public:
        THPracParam mRepParam;
        bool mRepSelected = false;
        uint32_t mSelectedRepStartStage;
        uint32_t mSelectedRepEndStage;
        uint32_t mSelectedRepPlaybackStartStage;
        std::wstring mSelectedRepName;
        std::wstring mSelectedRepDir;
        std::wstring mSelectedRepPath;

        void CheckReplay()
        {
            uintptr_t main_menu_ptr = GetMemContent(RVA(MAIN_MENU_PTR));
            uint32_t rep_offset = GetMemContent(main_menu_ptr + 0x5738) * 0x4 + 0x5740;
            std::wstring repName = mb_to_utf16(GetMemAddr<char*>(main_menu_ptr + rep_offset, 0x260), 932);
            std::wstring repDir(mAppdataPath);
            repDir.append(L"\\ShanghaiAlice\\th20\\replay\\");
            mSelectedRepName = repName;
            mSelectedRepDir = repDir;
            if (mSelectedRepPath != repDir + repName) {
                mSelectedRepPath = repDir + repName;
                ResetFixToolsSharedState();
            }

            std::string param;
            if (ReplayLoadParam(mSelectedRepPath.c_str(), param) && mRepParam.ReadJson(param))
                mParamStatus = true;
            else
                mRepParam.Reset();

            uint32_t* savedStones = GetMemAddr<uint32_t*>(main_menu_ptr + rep_offset, 0x1C, 0xDC);
            memcpy(replayStones, savedStones, sizeof(replayStones));

            for (int st = 1; st <= 7; ++st) {
                if (GetMemContent(main_menu_ptr + rep_offset, 0xf8 + 0x2c * st)) {
                    if (!mSelectedRepStartStage)
                        mSelectedRepStartStage = st;
                    mSelectedRepEndStage = st;
                }
            }
            if (advFixTimerOffsets && mSelectedRepPlaybackStartStage
                && repFixParamCopy.HasTransitionSyncData(mSelectedRepPlaybackStartStage))
                *(uint32_t*)(main_menu_ptr + 0x24) = mSelectedRepPlaybackStartStage;
        }

        bool mRepStatus = false;
        void State(int state)
        {
            switch (state) {
            case 1:
                mRepStatus = false;
                mParamStatus = false;
                mRepSelected = false;
                mSelectedRepStartStage = 0;
                mSelectedRepEndStage = 0;

                if (advFixTimerOffsets && thPracParam.HasTransitionSyncData())
                    repFixParamCopy = thPracParam;
                thPracParam.Reset();
                break;
            case 2:
                CheckReplay();
                mRepSelected = true;
                break;
            case 3:
                mRepStatus = true;
                mSelectedRepPlaybackStartStage = GetMemContent(RVA(MAIN_MENU_PTR), 0x24);
                stage_expired_summon_cnt = 0;

                if (advFixTimerOffsets && repFixParamCopy.HasTransitionSyncData())
                    thPracParam = repFixParamCopy;
                else if (mParamStatus)
                    thPracParam = mRepParam;

                if (advExtraFixResOpt && !thPracParam.resolutionSpriteHeight)
                    thPracParam.resolutionSpriteHeight = defaultSpriteHeights[advExtraFixResOpt];

                if (!mRepParam.HasExpStoneData()) // overwrite cached vectors from repFixParamCopy
                    for (size_t s = 0; s < elementsof(advExpStoneColors); ++s)
                        thPracParam.expStoneColors[s] = advExpStoneColors[s];

                break;
            default:
                break;
            }
        }

    protected:
        std::wstring mAppdataPath;
        bool mParamStatus = false;
    };
    class THOverlay : public Gui::GameGuiWnd {
        THOverlay() noexcept
        {
            SetTitle("Mod Menu");
            SetFade(0.5f, 0.5f);
            SetPos(10.0f, 10.0f);
            SetSize(0.0f, 0.0f);
            SetWndFlag(
                ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove | ImGuiWindowFlags_AlwaysAutoResize | ImGuiWindowFlags_NoSavedSettings | ImGuiWindowFlags_NoFocusOnAppearing | ImGuiWindowFlags_NoNav | 0);
            OnLocaleChange();
        }
        SINGLETON(THOverlay)

    public:
    protected:
        virtual void OnLocaleChange() override
        {
            float x_offset_1 = 0.0f;
            float x_offset_2 = 0.0f;
            switch (Gui::LocaleGet()) {
            case Gui::LOCALE_ZH_CN:
                x_offset_1 = 0.1f;
                x_offset_2 = 0.14f;
                break;
            case Gui::LOCALE_EN_US:
                x_offset_1 = 0.1f;
                x_offset_2 = 0.14f;
                break;
            case Gui::LOCALE_JA_JP:
                x_offset_1 = 0.1f;
                x_offset_2 = 0.14f;
                break;
            default:
                break;
            }

            mMenu.SetTextOffsetRel(x_offset_1, x_offset_2);
            mMuteki.SetTextOffsetRel(x_offset_1, x_offset_2);
            mInfLives.SetTextOffsetRel(x_offset_1, x_offset_2);
            mInfBombs.SetTextOffsetRel(x_offset_1, x_offset_2);
            mInfPower.SetTextOffsetRel(x_offset_1, x_offset_2);
            mHyperGLock.SetTextOffsetRel(x_offset_1, x_offset_2);
            mWonderStGLock.SetTextOffsetRel(x_offset_1, x_offset_2);
            mTimeLock.SetTextOffsetRel(x_offset_1, x_offset_2);
            mAutoBomb.SetTextOffsetRel(x_offset_1, x_offset_2);
            mElBgm.SetTextOffsetRel(x_offset_1, x_offset_2);
            mInGameInfo.SetTextOffsetRel(x_offset_1, x_offset_2);
        }
        virtual void OnContentUpdate() override
        {
            mMuteki();
            mInfLives();
            mInfBombs();
            mInfPower();
            mHyperGLock();
            mWonderStGLock();
            mAutoBomb();
            mTimeLock();
            mElBgm();
            mInGameInfo();
        }
        virtual void OnPreUpdate() override
        {
            if (mMenu(false) && !ImGui::IsAnyItemActive()) {
                if (*mMenu) {
                    Open();
                } else {
                    Close();
                }
            }
        }

        Gui::GuiHotKeyChord mMenu { "ModMenuToggle", "BACKSPACE", Gui::GetBackspaceMenuChord() };

        HOTKEY_DEFINE(mMuteki, TH_MUTEKI, "F1", VK_F1)
        PATCH_HK(0xF87FC, "01"),
        PATCH_HK(0xF8734, "EB")
        HOTKEY_ENDDEF();

        // HOTKEY_DEFINE(mInfLives, TH_INFLIVES, "F2", VK_F2)
        // PATCH_HK(0xE1288, "660F1F440000")
        // HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mInfBombs, TH_INFBOMBS, "F3", VK_F3)
        PATCH_HK(0xE1722, "0F1F00")
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mInfPower, TH_INFPOWER, "F4", VK_F4)
        PATCH_HK(0xE16A2, NOP(3)) // 0xE16A8
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mWonderStGLock, TH20_WST_LOCK, "F6", VK_F6)
        PATCH_HK(0x77F75, NOP(3)),
        PATCH_HK(0x1127AC, "E9AA000000CCCC"),
        PATCH_HK(0x112028, "EB"),
        PATCH_HK(0x112072, NOP(5)),
        PATCH_HK(0x1125c6, NOP(5)),
        PATCH_HK(0x112AA0, "C3CCCC")
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mAutoBomb, TH_AUTOBOMB, "F7", VK_F7)
        PATCH_HK(0xF79AC, "0F"),
        PATCH_HK(0xF79B3, "0F")
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mTimeLock, TH_TIMELOCK, "F8", VK_F8)
        PATCH_HK(0x86FDD, "EB"),
            PATCH_HK(0xA871E, "31")
                HOTKEY_ENDDEF();

    public:
        HOTKEY_DEFINE(mHyperGLock, TH20_HYP_LOCK, "F5", VK_F5)
        PATCH_HK(0x133935, NOP(3)),
        PATCH_HK(0x12FE5B, NOP(19)),
        PATCH_HK(0x1309A9, NOP(19)),
        PATCH_HK(0x1313DF, NOP(19)),
        PATCH_HK(0x1319C7, NOP(19)),
        PATCH_HK(0x131FFF, NOP(19)),
        PATCH_HK(0x1352EB, NOP(19)),
        PATCH_HK(0x13858B, NOP(19)),
        PATCH_HK(0x13652C, NOP(25)),
        PATCH_HK(0x1379DC, NOP(25))
        HOTKEY_ENDDEF();

        Gui::GuiHotKey mInfLives { TH_INFLIVES2, "F2", VK_F2 };
        Gui::GuiHotKey mElBgm { TH_EL_BGM, "F9", VK_F9 };
        Gui::GuiHotKey mInGameInfo { THPRAC_INGAMEINFO, "F10", VK_F10 };
    };

    // TODO(?)
    // static constinit HookCtx listIterUnlinkFix = { .addr = 0x11AB2, .data = PatchCode("e800000000") };
    EHOOK_ST(th20_piv_overflow_fix, 0xC496B, 2, {
        GlobalsSide* globals = (GlobalsSide*)RVA(GAME_SIDE0 + 0x88);

        int32_t half_piv_base = globals->piv_base / 2;
        int64_t uh_oh = (int64_t)globals->piv_base * globals->piv;
        pCtx->Esi = (int32_t)(uh_oh / globals->piv_divisor) + half_piv_base;
        pCtx->Eip = RVA(0xC49C4);
    });
    PATCH_ST(th20_piv_uncap_1, 0xA9FE5, "89D00F1F00");
    PATCH_ST(th20_piv_uncap_2, 0xB82E6, "89D00F1F00");
    PATCH_ST(th20_score_uncap, 0xE14F2, "EB");
    EHOOK_ST(th20_score_uncap_stage_tr, 0x10910F, 2, {
        pCtx->Esi += 8;
        pCtx->Edi += 8;
        pCtx->Ecx -= 2;
    });
    PATCH_ST(th20_infinite_stones, 0x11784B, "EB");
    PATCH_ST(th20_hitbox_scale_fix, 0xFF490, "B864000000C3");
    EHOOK_ST(th20_cleanup_stone_active, 0x11269f, 1, {
        // to make stoneActive work, we set the meter to max in init, let the game do its thing & adjust the meter/timer to the specified value
        GlobalsSide* globals = (GlobalsSide*)RVA(GAME_SIDE0 + 0x88);
        globals->summon_meter = (int32_t)(thPracParam.stone * thPracParam.stoneMax);

        // float interp_timer_val = 1320 - (1320 * thPracParam.stone);                         // option A: duration-accurate (50% stone = 50% of the duration)
        float interp_timer_val = 1320.0f * (1.0f - cbrtf(fmaxf(0.0001f, thPracParam.stone))); // option B: visuals-accurate (the drain meter is cubicly interpolated) (dont let it be 0) (just dont)
        
        Timer20* stone_interp_timer = GetMemAddr<Timer20*>(RVA(ENM_STONE_MGR_PTR), 0x84 + 0x14);
        asm_call_rel<SET_TIMER_FUNC, Thiscall>(stone_interp_timer, (int32_t)interp_timer_val);

        th20_cleanup_stone_active.Toggle(false);
    });

    PATCH_ST(th20_bullet_hitbox_fix_1, 0x3Efd2, "F30F108080000000F30F5C4224");
    PATCH_ST(th20_bullet_hitbox_fix_2, 0x3EFEA, "F30F108284000000F30F5C4128");

    PATCH_ST(th20_decrease_graze_effect, 0x9DC60, "C21000");

    float g_bossMoveDownRange = BOSS_MOVE_DOWN_RANGE_INIT;
    EHOOK_ST(th20_bossmovedown, 0x90953, 5, {
        float* y_pos = (float*)(pCtx->Eax + 0x17C);
        float* y_range = (float*)(pCtx->Eax + 0x184);
        if (g_bossMoveDownRange >= 0.0f)
        {
            float y_max = (*y_pos) + (*y_range) * 0.5f;
            float y_min2 = y_max - (*y_range) * (1.0f - g_bossMoveDownRange);
            *y_pos = (y_max + y_min2) * 0.5f;
            *y_range = (y_max - y_min2);
        }else{
            float y_min = (*y_pos) - (*y_range) * 0.5f;
            float y_max2 = y_min + (*y_range) * (1.0f - (-g_bossMoveDownRange));
            *y_pos = (y_min + y_max2) * 0.5f;
            *y_range = (y_max2 - y_min);
        }
    });
    HOOKSET_DEFINE(th20_master_disable)
    PATCH_DY(th20_master_disable1a, 0x87736, "eb")
    PATCH_DY(th20_master_disable1b, 0x8778F, "eb")
    PATCH_DY(th20_master_disable1c, 0x875E0, "03")
    HOOKSET_ENDDEF()

        
    class TH20InGameInfo : public Gui::GameGuiWnd {
        TH20InGameInfo() noexcept
        {
            SetTitle("igi");
            SetFade(0.9f, 0.9f);
            SetPosRel(890.0f / 1280.0f, 450.0f / 960.0f);
            SetSizeRel(360.0f / 1280.0f, 0.0f);
            SetWndFlag(ImGuiWindowFlags_NoScrollbar | ImGuiWindowFlags_NoScrollWithMouse | ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove | ImGuiWindowFlags_NoSavedSettings | ImGuiWindowFlags_NoInputs | ImGuiWindowFlags_NoFocusOnAppearing | ImGuiWindowFlags_NoNav | 0);
            OnLocaleChange();
        }
        SINGLETON(TH20InGameInfo)

    public:
        int32_t mMissCount;
        int32_t mBombCount;
        int32_t mHyperCount;
        int32_t mPyramidShotDownCount;
        int32_t mHyperBreakCount;

    protected:
        virtual void OnLocaleChange() override
        {
            float x_offset_1 = 0.0f;
            float x_offset_2 = 0.0f;
            switch (Gui::LocaleGet()) {
            case Gui::LOCALE_ZH_CN:
                x_offset_1 = 0.12f;
                x_offset_2 = 0.172f;
                break;
            case Gui::LOCALE_EN_US:
                x_offset_1 = 0.12f;
                x_offset_2 = 0.16f;
                break;
            case Gui::LOCALE_JA_JP:
                x_offset_1 = 0.18f;
                x_offset_2 = 0.235f;
                break;
            default:
                break;
            }
        }

        virtual void OnContentUpdate() override
        {
            uintptr_t player_stats = RVA(0x1BA5F0);

            int32_t cur_player_type = (*(int32_t*)(player_stats + 0x8));
            int32_t main_stone = (*(int32_t*)(player_stats + 0x1C));
            int32_t substone_1 = (*(int32_t*)(player_stats + 0x20));
            int32_t substone_2 = (*(int32_t*)(player_stats + 0x24));
            int32_t substone_3 = (*(int32_t*)(player_stats + 0x28));

            int32_t diff = *((int32_t*)(RVA(0x1BA7D0)));
            auto diff_pl = std::format("{} ({})", S(IGI_DIFF[diff]), S(IGI_PL_20[cur_player_type]));
            auto diff_pl_sz = ImGui::CalcTextSize(diff_pl.c_str());
            ImGui::SetCursorPosX(ImGui::GetWindowSize().x * 0.5f - diff_pl_sz.x * 0.5f);
            ImGui::Text(diff_pl.c_str());


            auto sub_pl = std::format("{}({}/{}/{})", S(IGI_PL_20_SUB[main_stone]), S(IGI_PL_20_SUB[substone_1]), S(IGI_PL_20_SUB[substone_3]), S(IGI_PL_20_SUB[substone_2]));

            auto sub_pl_sz = ImGui::CalcTextSize(sub_pl.c_str());
            ImGui::SetCursorPosX(ImGui::GetCursorPosX() + std::max(0.0f, ImGui::GetWindowSize().x * 0.5f - sub_pl_sz.x * 0.5f));

            const ImVec4 r = { 1.0f, 0.5f, 0.5f, 1.0f };
            const ImVec4 g = { 0.5f, 1.0f, 0.5f, 1.0f };
            const ImVec4 b = { 0.5f, 0.75f, 1.0f, 1.0f };
            const ImVec4 y = { 1.0f, 1.0f, 0.3f, 1.0f };
            const ImVec4 w = { 1.0f, 1.0f, 1.0f, 1.0f };
            const ImVec4 p = { 1.0f, 0.5f, 1.0f, 1.0f };
            const ImVec4 rk = { 0.9f, 0.2f, 0.2f, 1.0f };
            const ImVec4 gk = { 0.2f, 0.7f, 0.2f, 1.0f };
            const ImVec4 bk = { 0.1f, 0.5f, 1.0f, 1.0f };
            const ImVec4 yk = { 0.8f, 0.8f, 0.2f, 1.0f };
            const ImVec4 spells_colors[] = { p, r, b, y, g, w };
            const ImVec4 stones_colors[] = { r, rk, b, bk, y, yk, g, gk, w };

            ImGui::TextColored(stones_colors[main_stone], S(IGI_PL_20_SUB[main_stone]));
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::Text("(");
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::TextColored(stones_colors[substone_1], S(IGI_PL_20_SUB[substone_1]));
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::Text("/");
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::TextColored(stones_colors[substone_3], S(IGI_PL_20_SUB[substone_3]));
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::Text("/");
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::TextColored(stones_colors[substone_2], S(IGI_PL_20_SUB[substone_2]));
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::Text(")");


            ImGui::Columns(2);
            ImGui::Text(S(THPRAC_INGAMEINFO_MISS_COUNT));
            ImGui::NextColumn();
            ImGui::Text("%9d", mMissCount);
            ImGui::NextColumn();
            ImGui::Text(S(THPRAC_INGAMEINFO_BOMB_COUNT));
            ImGui::NextColumn();
            ImGui::Text("%9d", mBombCount);
            ImGui::NextColumn();
            ImGui::Text(S(THPRAC_INGAMEINFO_20_HYPER_COUNT));
            ImGui::NextColumn();
            ImGui::Text("%9d", mHyperCount);
            ImGui::NextColumn();
            ImGui::Text(S(THPRAC_INGAMEINFO_20_HYPER_BREAK_COUNT));
            ImGui::NextColumn();
            if (main_stone == 4) // yellow 1
            {
                ImGui::TextColored(y, "%9d", mHyperBreakCount);
            }else{
                ImGui::Text("%9d", mHyperBreakCount);
            }
            ImGui::NextColumn();
            ImGui::Text(S(THPRAC_INGAMEINFO_20_PYRAMID_COUNT));
            ImGui::NextColumn();
            ImGui::Text("%9d", mPyramidShotDownCount);

            ImGui::NextColumn();
            ImGui::Text(S(THPRAC_INGAMEINFO_20_PYRAMID_SUMMONED_COUNT));
            ImGui::NextColumn();
            int32_t pyramids_summoned = *(int32_t*)(player_stats + 0x94);
            if (pyramids_summoned % 3 == 0)
                ImGui::TextColored(r, "%9d", pyramids_summoned);
            else
                ImGui::TextColored(g, "%9d", pyramids_summoned);
            
            auto lvR = *(int32_t*)(player_stats + 0x74);
            auto lvB = *(int32_t*)(player_stats + 0x78);
            auto lvY = *(int32_t*)(player_stats + 0x7C);
            auto lvG = *(int32_t*)(player_stats + 0x80);

            ImGui::NextColumn();
            ImGui::Text(S(THPRAC_INGAMEINFO_20_PYRAMID_LV));
            ImGui::NextColumn();
            ImGui::TextColored(r, "%d", lvR+1);
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::Text("/");
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::TextColored(b, "%d", lvB+1);
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::Text("/");
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::TextColored(y, "%d", lvY+1);
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::Text("/");
            ImGui::SameLine(0.0f, 0.0f);
            ImGui::TextColored(g, "%d", lvG+1);
            ImGui::SameLine(0.0f, 0.0f);

            int32_t stage = GetMemContent(RVA(STAGE_NUM));
            if ((stage == 4 || stage == 5)
                && TH20Save::singleton().pyraState.isInPyra) {
                ImGui::Columns(1);
                const char* spells_str[6] = {
                    S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID1),
                    S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID2R),
                    S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID2B),
                    S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID2Y),
                    S(THPRAC_INGAMEINFO_20_PYRAMID_ST4_MID2G),
                    S(THPRAC_INGAMEINFO_20_PYRAMID_ST5_MID1),
                };
                int spid = TH20Save::singleton().pyraState.lastPyraSpellId;
                int plstone_type = TH20Save::GetPlayerType(cur_player_type, main_stone);
                ImGui::NewLine();
                

                ImVec4 spell_color = spells_colors[spid];
                if (spid == 5 && g_adv_igi_options.th12_chromatic_ufo) // st5 pyra
                {
                    static float t = 0;
                    t += 0.003f;
                    if (t >= 1.0f)
                        t = 0.0f;
                    float rr, gg, bb;
                    ImGui::ColorConvertHSVtoRGB(fmodf(t, 1.0f), 0.4f, 1.0f, rr, gg, bb);
                    spell_color = { rr, gg, bb, 1.0f };
                }
                if (TH20Save::singleton().pyraState.isPyraFailed)
                {
                    float rr, gg, bb, hh, ss, vv;
                    ImGui::ColorConvertRGBtoHSV(spell_color.x, spell_color.y, spell_color.z, hh, ss, vv);
                    ImGui::ColorConvertHSVtoRGB(hh, ss * 0.5f, 0.5f, rr, gg, bb);
                    spell_color = { rr, gg, bb, 1.0f };
                }

                ImGui::SetCursorPosX(ImGui::GetWindowSize().x * 0.5f - ImGui::CalcTextSize(spells_str[spid]).x * 0.5f);
                auto cpos = ImGui::GetCursorScreenPos();
                ImGui::TextColored(spell_color, spells_str[spid]);
                auto cpos2 = ImGui::GetCursorScreenPos();
                if (TH20Save::singleton().pyraState.isPyraFailed) {
                    auto textsz = ImGui::CalcTextSize(spells_str[spid]);
                    auto p = ImGui::GetWindowDrawList();
                    p->AddLine({ cpos.x, (cpos.y + cpos2.y) * 0.5f }, { cpos.x + textsz.x, (cpos.y + cpos2.y) * 0.5f },ImGui::ColorConvertFloat4ToU32(spell_color), 1.0f);
                }
                ImGui::Columns(2);
                if (thPracParam.mode) {
                    ImGui::TextColored(spell_color, S(THPRAC_INGAMEINFO_20_PASS_CUR));
                    ImGui::NextColumn();
                    ImGui::TextColored(spell_color, "%4d/%d(%.1f%%)",
                        TH20Save::singleton().saveCurrent.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Capture] + TH20Save::singleton().saveCurrent.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Timeout],
                        TH20Save::singleton().saveCurrent.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Attempt],
                        ((float)(TH20Save::singleton().saveCurrent.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Capture] + TH20Save::singleton().saveCurrent.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Timeout])
                            / std::fmaxf(1.0f, ((float)TH20Save::singleton().saveCurrent.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Attempt])) * 100.0f));
                    ImGui::NextColumn();
                    ImGui::TextColored(spell_color, S(THPRAC_INGAMEINFO_20_PASS_TOT));
                    ImGui::NextColumn();
                    ImGui::TextColored(spell_color, "%4d/%d(%.1f%%)",
                        TH20Save::singleton().saveTotal.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Capture] + TH20Save::singleton().saveTotal.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Timeout],
                        TH20Save::singleton().saveTotal.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Attempt],
                        ((float)(TH20Save::singleton().saveTotal.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Capture] + TH20Save::singleton().saveTotal.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Timeout])
                            / std::fmaxf(1.0f, ((float)TH20Save::singleton().saveTotal.ScHistoryPrac[spid][diff][plstone_type][TH20Save::Attempt])) * 100.0f));
                }
                else
                {
                    ImGui::TextColored(spell_color, S(THPRAC_INGAMEINFO_20_PASS_CUR));
                    ImGui::NextColumn();
                    ImGui::TextColored(spell_color, "%4d/%d(%.1f%%)",
                        TH20Save::singleton().saveCurrent.ScHistory[spid][diff][plstone_type][TH20Save::Capture] + TH20Save::singleton().saveCurrent.ScHistory[spid][diff][plstone_type][TH20Save::Timeout],
                        TH20Save::singleton().saveCurrent.ScHistory[spid][diff][plstone_type][TH20Save::Attempt],
                        ((float)(TH20Save::singleton().saveCurrent.ScHistory[spid][diff][plstone_type][TH20Save::Capture] + TH20Save::singleton().saveCurrent.ScHistory[spid][diff][plstone_type][TH20Save::Timeout])
                            / std::fmaxf(1.0f, ((float)TH20Save::singleton().saveCurrent.ScHistory[spid][diff][plstone_type][TH20Save::Attempt])) * 100.0f));
                    ImGui::NextColumn();
                    ImGui::TextColored(spell_color, S(THPRAC_INGAMEINFO_20_PASS_TOT));
                    ImGui::NextColumn();
                    ImGui::TextColored(spell_color, "%4d/%d(%.1f%%)",
                        TH20Save::singleton().saveTotal.ScHistory[spid][diff][plstone_type][TH20Save::Capture] + TH20Save::singleton().saveTotal.ScHistory[spid][diff][plstone_type][TH20Save::Timeout],
                        TH20Save::singleton().saveTotal.ScHistory[spid][diff][plstone_type][TH20Save::Attempt],
                        ((float)(TH20Save::singleton().saveTotal.ScHistory[spid][diff][plstone_type][TH20Save::Capture] + TH20Save::singleton().saveTotal.ScHistory[spid][diff][plstone_type][TH20Save::Timeout])
                            / std::fmaxf(1.0f, ((float)TH20Save::singleton().saveTotal.ScHistory[spid][diff][plstone_type][TH20Save::Attempt])) * 100.0f));
                }
            }
        }

        virtual void OnPreUpdate() override
        {
            if (*(DWORD*)(RVA(0x1ba56c))) {
                GameUpdateInner(20);
            } else {
            }
            if (*(THOverlay::singleton().mInGameInfo) && *(DWORD*)(RVA(0x1ba56c))) {
                SetPosRel(890.0f / 1280.0f, 450.0f / 960.0f);
                SetSizeRel(360.0f / 1280.0f, 0.0f);
                Open();
            } else {
                Close();
            }
        }

    public:
    };

    class THAdvOptWnd : public Gui::PPGuiWnd {
        SINGLETON(THAdvOptWnd)

    public:
        bool forceBossMoveDown = false;
    private:
    private:
        bool plHitboxScaleFix = false;
        bool showExpiredPyramidFixTool = false;

        void MasterDisableInit()
        {
            for (int i = 0; i < 3; i++)
                th20_master_disable[i].Setup();
            for (int i = 0; i < 3; i++)
                th20_master_disable[i].Toggle(g_adv_igi_options.disable_master_autoly);
        }
        void FpsInit()
        {
            mOptCtx.fps_dbl = 60.0;

            if (GetMemContent<uint8_t>(RVA(0x1C4F89)) == 3) {
                mOptCtx.fps_status = 1;

                DWORD oldProtect;
                VirtualProtect((void*)RVA(0x19EAF), 4, PAGE_EXECUTE_READWRITE, &oldProtect);
                *(double**)RVA(0x19EAF) = &mOptCtx.fps_dbl;
                VirtualProtect((void*)RVA(0x19EAF), 4, oldProtect, &oldProtect);
            } else
                mOptCtx.fps_status = 0;
        }
        void FpsSet()
        {
            if (mOptCtx.fps_status == 1) {
                mOptCtx.fps_dbl = (double)mOptCtx.fps;
            }
        }
        void GameplayInit()
        {
        }
        void GameplaySet()
        {
        }

        // From zero318
        struct ZUNListIter;
        struct ZUNListIterable;

        struct ZUNList {
            void* data; // 0x0
            ZUNList* next; // 0x4
            ZUNList* prev; // 0x8
            ZUNListIterable* list; // 0xC
            ZUNListIter* current_iter; // 0x10
        };

        struct ZUNListIter {
            ZUNList* current; // 0x0
            ZUNList* next; // 0x4
        };

        struct ZUNListIterable : ZUNList {
            ZUNList* tail; // 0x14
            ZUNListIter iter; // 0x18
        };

        static void __fastcall UnlinkNodeHook(ZUNListIterable* self, void*, ZUNList* node)
        {
            memset(&self->iter, 0, sizeof(self->iter));
            asm_call_rel<0x11AD0, Thiscall>(self, node);
        }

        THAdvOptWnd() noexcept
        {
            SetWndFlag(ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoCollapse | ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoMove);
            SetFade(0.8f, 0.8f);
            SetStyle(ImGuiStyleVar_WindowRounding, 0.0f);
            SetStyle(ImGuiStyleVar_WindowBorderSize, 0.0f);

            InitUpdFunc([&]() { ContentUpdate(); },
                [&]() { LocaleUpdate(); },
                [&]() {},
                []() {});

            OnLocaleChange();
            FpsInit();
            GameplayInit();
            MasterDisableInit();

            
            th20_bossmovedown.Setup();
            th20_piv_overflow_fix.Setup();
