#include "thprac_games.h"
#include "thprac_utils.h"
#include <format>
#include <math.h>

#include "utils/wininternal.h"

// WTF Microsoft
#undef hyper

namespace THPrac {
namespace TH20 {
    using std::pair;
    using namespace TH20;

    enum rel_addrs {
        WINDOW_PTR = 0x1b6758,
        GAME_SIDE0 = 0x1ba568,
        PLAYER_PTR = GAME_SIDE0 + 0x4,
        DMG_SRC_MGR_PTR = GAME_SIDE0 + 0x28,
        MODEFLAGS = GAME_SIDE0 + 0x70,
        STAGE_NUM = GAME_SIDE0 + 0x88 + 0x1f4,
        GAME_THREAD_PTR = 0x1ba828,
        TRANSITION_STG_PTR = 0x1c06a0,
        REPLAY_MGR_PTR = 0x1c60fc,
        ENM_STONE_MGR_PTR = 0x1c6118,
        MAIN_MENU_PTR = 0x1c6124,
        SET_TIMER_FUNC = 0x23520,
        ADD_TIMER_FUNC = 0x297A0,
        ALLOCATE_DMG_SRC_FUNC = 0xc0e60,
        DELETE_DMG_SRC_FUNC = 0xc1f30
    };

    struct AnmVM {
        char gap0[0x20];
        uint32_t sprite_id; // 0x20
        uint32_t script_id; // 0x24
        char gap1[0x48];
        Float2 sprite_dims; // 0x70
        char gap2[0x420];
        uint16_t anm_draw_mode; // 0x498, contains both render & blend mode
    };

    struct PlayerDamageSource {
        PlayerDamageSource* self_ptr; // 0x0
        PlayerDamageSource* list_next; // 0x4
        PlayerDamageSource* list_prev; // 0x8
        void* iterable_list; // 0xc
        void* cur_iterator; // 0x10
        uint32_t flags; // 0x14
        float radius; // 0x18
        float unknown_float_1c; // 0x1c
        float radius_delta; // 0x20
        float angle; // 0x24
        float angular_velocity; // 0x28
        Float2 size; // 0x2c
        Float2 position; // 0x34
        char otherMotionData[0x40]; // 0x3c
        Timer20 duration; // 0x7c
        uint32_t id; // 0x8c
        uint32_t player_bullet_id; // 0x90
        int32_t damage; // 0x94
        int32_t damage_dealt; // 0x98
        int32_t damage_cap; // 0x9c
        int32_t hit_freq; // 0xa0
        char variousUnknowns[0x18]; // 0xa4
        uint32_t side_index; // 0xbc
        void* game_side; // 0xc0
    };

    // maps original resolution option id to the corresponding height of the default (sprite -1) anm sprite
    // used for Nina Sp4 desync fix
    float defaultSpriteHeights[4] = { 0.0f, 6.0f, 10.0f, 14.0f };

    struct THPracParam {
        int32_t mode;
        int32_t stage;
        int32_t section;
        int32_t phase;

        int64_t score;
        int32_t life;
        int32_t life_fragment;
        int32_t bomb;
        int32_t bomb_fragment;
        int32_t cycle;
        int32_t power;
        int32_t value;

        float hyper;
        float stone;
        bool hyperActive;
        bool stoneActive;
        int32_t stoneMax;
        int32_t levelR;
        int32_t priorityR;
        int32_t levelB;
        int32_t priorityB;
        int32_t levelY;
        int32_t priorityY;
        int32_t levelG;
        int32_t priorityG;

        int32_t reimuR2Timer[7];
        int32_t passiveMeterTimer[7];
        int32_t yellow2CycleAngle[7][4];
        int32_t yellow2CycleTimer[7][4];
        float resolutionSpriteHeight;
        std::vector<PlayerDamageSource> rogueDmgSrcs[7];
        uint32_t nextDmgID[7];

        bool dlg;

        bool _playLock = false;
        void Reset()
        {
            for (size_t st = 0; st < elementsof(rogueDmgSrcs); ++st)
                rogueDmgSrcs[st].clear();

            memset(this, 0, sizeof(THPracParam));
        }
        bool ReadJson(std::string& json)
        {
            ParseJson();

            ForceJsonValue(game, "th20");
            GetJsonValue(mode);
            GetJsonValue(stage);
            GetJsonValue(section);
            GetJsonValue(phase);
            GetJsonValueEx(dlg, Bool);

            GetJsonValue(score);
            GetJsonValue(life);
            GetJsonValue(life_fragment);
            GetJsonValue(bomb);
            GetJsonValue(bomb_fragment);
            GetJsonValue(cycle);
            GetJsonValue(power);
            GetJsonValue(value);

            GetJsonValue(hyper);
            GetJsonValue(stone);
            GetJsonValueEx(hyperActive, Bool);
            GetJsonValueEx(stoneActive, Bool);
            GetJsonValue(stoneMax);
            GetJsonValue(levelR);
            GetJsonValue(priorityR);
            GetJsonValue(levelB);
            GetJsonValue(priorityB);
            GetJsonValue(levelY);
            GetJsonValue(priorityY);
            GetJsonValue(levelG);
            GetJsonValue(priorityG);

            GetJsonArray(reimuR2Timer, elementsof(reimuR2Timer));
            GetJsonArray(passiveMeterTimer, elementsof(passiveMeterTimer));
            GetJsonArray2D(yellow2CycleAngle, elementsof(yellow2CycleAngle), elementsof(yellow2CycleAngle[0]));
            GetJsonArray2D(yellow2CycleTimer, elementsof(yellow2CycleTimer), elementsof(yellow2CycleTimer[0]));
            GetJsonValue(resolutionSpriteHeight);

            // deserializing damage source data (for Y1 lingering hitbox desync fix)
            GetJsonVectorArray(rogueDmgSrcs, {
                if (!el.IsArray() || el.Size() * sizeof(int32_t) != sizeof(PlayerDamageSource))
                    return std::nullopt;

                PlayerDamageSource dmgSrc {};
                int32_t* p = (int32_t*)&dmgSrc;
                for (rapidjson::SizeType i = 0; i < el.Size(); i++)
                    p[i] = el[i].GetInt();

                return dmgSrc;
            });
            GetJsonArray(nextDmgID, elementsof(nextDmgID));

            return true;
        }
        std::string GetJson()
        {
            if (mode == 0) {
                CreateJson();

                AddJsonValueEx(version, GetVersionStr(), jalloc);
                AddJsonValueEx(game, "th20", jalloc);
                AddJsonValue(mode);

                AddJsonArray(reimuR2Timer, elementsof(reimuR2Timer));
                AddJsonArray(passiveMeterTimer, elementsof(passiveMeterTimer));

                auto selected = (uint32_t*)(RVA(GAME_SIDE0) + 0x88 + 0x1C);
                if (selected[1] == 5 || selected[2] == 5) { //lotta zeros we don't need to store
                    AddJsonArray2D(yellow2CycleAngle, elementsof(yellow2CycleAngle), elementsof(yellow2CycleAngle[0]));
                    AddJsonArray2D(yellow2CycleTimer, elementsof(yellow2CycleTimer), elementsof(yellow2CycleTimer[0]));
                }

                AddJsonVectorArray(rogueDmgSrcs, {
                    rapidjson::Value dmgSrcArray(rapidjson::kArrayType);

                    int32_t* p = (int32_t*)&el;
                    size_t count = sizeof(PlayerDamageSource) / sizeof(int32_t);
                    for (size_t i = 0; i < count; ++i)
                        dmgSrcArray.PushBack(p[i], jalloc);

                    return dmgSrcArray;
                });
                AddJsonArray(nextDmgID, elementsof(nextDmgID));

                AddJsonValue(resolutionSpriteHeight);

                ReturnJson();
            } else if (mode == 1) {
                CreateJson();

                AddJsonValueEx(version, GetVersionStr(), jalloc);
                AddJsonValueEx(game, "th20", jalloc);
                AddJsonValue(mode);
                AddJsonValue(stage);
                if (section)
                    AddJsonValue(section);
                if (phase)
                    AddJsonValue(phase);
                if (dlg)
                    AddJsonValue(dlg);

                AddJsonValue(score);
                AddJsonValue(life);
                AddJsonValue(life_fragment);
                AddJsonValue(bomb);
                AddJsonValue(bomb_fragment);
                AddJsonValue(cycle);
                AddJsonValue(power);
                AddJsonValue(value);

                AddJsonValue(hyper);
                AddJsonValue(stone);
                AddJsonValue(hyperActive);
                AddJsonValue(stoneActive);
                AddJsonValue(stoneMax);
                AddJsonValue(levelR);
                AddJsonValue(priorityR);
                AddJsonValue(levelB);
                AddJsonValue(priorityB);
                AddJsonValue(levelY);
                AddJsonValue(priorityY);
                AddJsonValue(levelG);
                AddJsonValue(priorityG);

                AddJsonValue(resolutionSpriteHeight);

                ReturnJson();
            }

            CreateJson();
            jalloc; // Dummy usage to silence C4189
            ReturnJson();
        }

        bool HasTransitionSyncData(int st = 0) {
            if (!st) { //default: has ANY data (these can be 0 on st1 but not on later stages)
                st = 1;
                for (size_t s = st; s < 6; ++s)
                    if (yellow2CycleTimer[s][0] || rogueDmgSrcs[s].size())
                        return true;
            }

            //timer values should be non-zero on 1st stage transition if recorded
            //y2 opt timer checked per stage because you could otherwise make an adversarial replay (dont bring out y2 options until later stage)
            return reimuR2Timer[st] || passiveMeterTimer[st] || yellow2CycleTimer[st][0] || rogueDmgSrcs[st].size();
        }
    };

    THPracParam thPracParam {};
    uint32_t replayStones[4] {};

    constexpr uint32_t minTimerOffsets[5] = { 39, 40, 49, 43, 44 }; // # of anm entries loaded on transition (max 1 per frame)
    constexpr uint32_t TIMER_OFFSET_MAX = 200;

    size_t advExtraFixResOpt = 0;
    bool advFixTimerOffsets = false;
    int32_t deterministicTransitionR2TimerVal = 0; //used to normalize variable delay before stage transition
    Gui::GuiDrag<uint32_t, ImGuiDataType_S32> advFixedTimerOffsets[5] = {
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st2", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 },
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st3", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 },
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st4", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 },
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st5", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 },
        Gui::GuiDrag<uint32_t, ImGuiDataType_S32> { "##mainrpyfix_st6", 0, (uint32_t)TIMER_OFFSET_MAX, 1, 100 }
    };
    THPracParam repFixParamCopy {};

    void ResetFixToolsSharedState() {
        // reset replay fix tools shared state iff replay selection changed or went back to title screen
        // shared state & not AdvWnd public members to avoid ugly forward declaration
        advExtraFixResOpt = 0;
        advFixTimerOffsets = false;
        deterministicTransitionR2TimerVal = 0;
        for (auto& off : advFixedTimerOffsets) *off = 0;
        repFixParamCopy.Reset();
    }

    class THGuiPrac : public Gui::GameGuiWnd {
        THGuiPrac() noexcept
        {
            *mMode = 1;
            *mLife = 7;
            *mBomb = 7;
            *mPower = 400;
            *mValue = 0;
            *mLevelR = 1;
            *mLevelB = 1;
            *mLevelY = 1;
            *mLevelG = 1;
            *mPriorityR = 0;
            *mPriorityB = 0;
            *mPriorityY = 0;
            *mPriorityG = 0;

            SetFade(0.8f, 0.1f);
            SetStyle(ImGuiStyleVar_WindowRounding, 0.0f);
            SetStyle(ImGuiStyleVar_WindowBorderSize, 0.0f);
            OnLocaleChange();
        }
        SINGLETON(THGuiPrac);

    public:
        __declspec(noinline) void State(int state)
        {
            switch (state) {
            case 0:
                break;
            case 1:
                mDiffculty = *((int32_t*)RVA(0x1B0A60));
                SetFade(0.8f, 0.1f);
                Open();
                thPracParam.Reset();
            case 2:
                break;
            case 3: {
                SetFade(0.8f, 0.1f);
                Close();

                // Fill Param
                thPracParam.mode = *mMode;
                thPracParam.stage = *mStage;
                thPracParam.section = CalcSection();
                thPracParam.phase = SpellPhase() ? *mPhase : 0;
                if (SectionHasDlg(thPracParam.section))
                    thPracParam.dlg = *mDlg;

                thPracParam.score = *mScore;
                thPracParam.life = *mLife;
                thPracParam.life_fragment = *mLifeFragment;
                thPracParam.bomb = *mBomb;
                thPracParam.bomb_fragment = *mBombFragment;
                thPracParam.cycle = *mCycle;
                thPracParam.power = *mPower;
                thPracParam.value = *mValue;

                thPracParam.hyperActive = *mHyperActive;
                thPracParam.stoneActive = *mStoneActive;
                int stoneMaxStageDefault = 1100;
                if (*mStage == 1) stoneMaxStageDefault = 1200;
                if (*mStage == 2) stoneMaxStageDefault = 1300;
                if (*mStage >= 3) stoneMaxStageDefault = 1400;
                thPracParam.hyper = *mHyper / 10000.0f;
                thPracParam.stone = *mStone / 10000.0f;
                thPracParam.stoneMax = stoneMaxStageDefault + *mStoneSummoned * 150;
                thPracParam.levelR = *mLevelR - 1;
                thPracParam.priorityR = *mPriorityR;
                thPracParam.levelB = *mLevelB - 1;
                thPracParam.priorityB = *mPriorityB;
                thPracParam.levelG = *mLevelG - 1;
                thPracParam.priorityG = *mPriorityG;
                thPracParam.levelY = *mLevelY - 1;
                thPracParam.priorityY = *mPriorityY;
                break;
            }
            case 4:
                Close();
                break;
            default:
                break;
            }
        }

    protected:
        virtual void OnLocaleChange() override
        {
            SetTitle(S(TH_MENU));
            switch (Gui::LocaleGet()) {
            case Gui::LOCALE_ZH_CN:
                SetSizeRel(0.65f, 0.81f);
                SetPosRel(0.27f, 0.18f);
                SetItemWidthRel(-0.100f);
                SetAutoSpacing(true);
                break;
            case Gui::LOCALE_EN_US:
                SetSizeRel(0.6f, 0.79f);
                SetPosRel(0.215f, 0.18f);
                SetItemWidthRel(-0.100f);
                SetAutoSpacing(true);
                break;
            case Gui::LOCALE_JA_JP:
                SetSizeRel(0.56f, 0.81f);
                SetPosRel(0.230f, 0.18f);
                SetItemWidthRel(-0.105f);
                SetAutoSpacing(true);
                break;
            default:
                break;
            }
        }
        virtual void OnContentUpdate() override
        {
            ImGui::TextUnformatted(S(TH_MENU));
            ImGui::Separator();

            PracticeMenu();
        }
        const th_glossary_t* SpellPhase()
        {
            auto section = CalcSection();
            if (section == TH20_ST7_BOSS17)
                return TH_SPELL_PHASE_TIMEOUT;
            if (section == TH20_ST6_BOSS12 || section == TH20_ST7_BOSS18)
                return TH_SPELL_PHASE2;
            return nullptr;
        }
        void PracticeMenu()
        {
            mMode();
            if (mStage())
                *mSection = *mChapter = 0;
            if (*mMode == 1) {
                int mbs = -1;
                if (*mStage == 2 || *mStage == 5) { // Counting from 0
                    mbs = 2;
                    if (*mWarp == 2)
                        *mWarp = 0;
                }

                if (mWarp(mbs))
                    *mSection = *mChapter = *mPhase = 0;
                if (*mWarp) {
                    SectionWidget();
                    mPhase(TH_PHASE, SpellPhase());
                }

                mLife();
                mLifeFragment();
                mBomb();
                mBombFragment();
                auto power_str = std::to_string((float)(*mPower) / 100.0f).substr(0, 4);
                mPower(power_str.c_str());
                auto value_str = std::format("{:.2f}", (float)(*mValue) / 5000.0f);
                mValue(value_str.c_str());

                ImGui::Columns(2, 0, false);
                if (mHyperActive()) {
                    if (*mHyperActive && *mHyper == 0) *mHyper = 10000;
                    if (!*mHyperActive && *mHyper == 10000) *mHyper = 0;
                }
                ImGui::NextColumn();
                if (mStoneActive()) {
                    if (*mStoneActive && *mStone == 0) *mStone = 10000;
                    if (!*mStoneActive && *mStone == 10000) *mStone = 0;
                }
                ImGui::Columns(1);

                mHyper(std::format("{:.2f} %%", (float)(*mHyper) / 100.0f).c_str());
                mStone(std::format("{:.2f} %%", (float)(*mStone) / 100.0f).c_str());
                mStoneSummoned();
                mCycle();

                ImGui::Columns(2);
                auto& style = ImGui::GetStyle();
                auto old_col = style.Colors[ImGuiCol_SliderGrab];
                auto old_col_active = style.Colors[ImGuiCol_SliderGrabActive];

                style.Colors[ImGuiCol_SliderGrab] = ImVec4(1.0f, 0.25f, 0.25f, 0.40f);
                style.Colors[ImGuiCol_SliderGrabActive] = ImVec4(1.0f, 0.25f, 0.25f, 1.0f);
                mLevelR();
                ImGui::NextColumn();
                mPriorityR();

                style.Colors[ImGuiCol_SliderGrab] = ImVec4(0.25f, 0.25f, 1.0f, 0.40f);
                style.Colors[ImGuiCol_SliderGrabActive] = ImVec4(0.25f, 0.25f, 1.0f, 1.0f);
                ImGui::NextColumn();
                mLevelB();
                ImGui::NextColumn();
                mPriorityB();

                style.Colors[ImGuiCol_SliderGrab] = ImVec4(1.0f, 1.0f, 0.25f, 0.40f);
                style.Colors[ImGuiCol_SliderGrabActive] = ImVec4(1.0f, 1.0f, 0.25f, 1.0f);
                ImGui::NextColumn();
                mLevelY();
                ImGui::NextColumn();
                mPriorityY();

                style.Colors[ImGuiCol_SliderGrab] = ImVec4(0.25f, 1.0f, 0.25f, 0.40f);
                style.Colors[ImGuiCol_SliderGrabActive] = ImVec4(0.0f, 1.0f, 0.25f, 1.0f);
                ImGui::NextColumn();
                mLevelG();
                ImGui::NextColumn();
                mPriorityG();

                style.Colors[ImGuiCol_SliderGrab] = old_col;
                style.Colors[ImGuiCol_SliderGrabActive] = old_col_active;
                ImGui::Columns(1);

                mScore();
                mScore.RoundDown(10);
            }
        }
        int CalcSection()
        {
            int chapterId = 0;
            switch (*mWarp) {
            case 1: // Chapter
                // Chapter Id = 10000 + Stage * 100 + Section
                chapterId += (*mStage + 1) * 100;
                chapterId += *mChapter;
                chapterId += 10000; // Base of chapter ID is 1000.
                return chapterId;
                break;
            case 2:
            case 3: // Mid boss & End boss
                return th_sections_cba[*mStage][*mWarp - 2][*mSection];
                break;
            case 4:
            case 5: // Non-spell & Spellcard
                return th_sections_cbt[*mStage][*mWarp - 4][*mSection];
                break;
            default:
                return 0;
                break;
            }
        }
        bool SectionHasDlg(int32_t section)
        {
            switch (section) {
            case TH20_ST1_BOSS1:
            case TH20_ST2_BOSS1:
            case TH20_ST3_BOSS1:
            case TH20_ST4_BOSS1:
            case TH20_ST5_BOSS1:
            case TH20_ST6_BOSS1:
            case TH20_ST6_BOSS5:
            case TH20_ST6_BOSS9:
            case TH20_ST7_MID1:
            case TH20_ST7_BOSS1:
                return true;
            default:
                return false;
            }
        }
        void SectionWidget()
        {
            static char chapterStr[256] {};
            auto& chapterCounts = mChapterSetup[*mStage];

            switch (*mWarp) {
            case 1: // Chapter
                mChapter.SetBound(1, chapterCounts[0] + chapterCounts[1]);

                if (chapterCounts[1] == 0 && chapterCounts[2] != 0) {
                    sprintf_s(chapterStr, S(TH_STAGE_PORTION_N), *mChapter);
                } else if (*mChapter <= chapterCounts[0]) {
                    sprintf_s(chapterStr, S(TH_STAGE_PORTION_1), *mChapter);
                } else {
                    sprintf_s(chapterStr, S(TH_STAGE_PORTION_2), *mChapter - chapterCounts[0]);
                };

                mChapter(chapterStr);
                break;
            case 2:
            case 3: // Mid boss & End boss
                if (mSection(TH_WARP_SELECT[*mWarp],
                        th_sections_cba[*mStage][*mWarp - 2],
                        th_sections_str[::THPrac::Gui::LocaleGet()][mDiffculty]))
                    *mPhase = 0;
                if (SectionHasDlg(th_sections_cba[*mStage][*mWarp - 2][*mSection]))
                    mDlg();
                break;
            case 4:
            case 5: // Non-spell & Spellcard
                if (mSection(TH_WARP_SELECT[*mWarp],
                        th_sections_cbt[*mStage][*mWarp - 4],
                        th_sections_str[::THPrac::Gui::LocaleGet()][mDiffculty]))
                    *mPhase = 0;
                if (SectionHasDlg(th_sections_cbt[*mStage][*mWarp - 4][*mSection]))
                    mDlg();
                break;
            default:
                break;
            }
        }

        Gui::GuiCombo mMode { TH_MODE, TH_MODE_SELECT };
        Gui::GuiCombo mStage { TH_STAGE, TH_STAGE_SELECT };
        Gui::GuiCombo mWarp { TH_WARP, TH_WARP_SELECT };
        Gui::GuiCombo mSection { TH_MODE };
        Gui::GuiCombo mPhase { TH_PHASE };
        Gui::GuiCheckBox mDlg { TH_DLG };
        Gui::GuiCombo mCycle { TH14_CYCLE, TH20_CYCLE_LIST };

        Gui::GuiSlider<int, ImGuiDataType_S32> mChapter { TH_CHAPTER, 0, 0 };
        Gui::GuiDrag<int64_t, ImGuiDataType_S64> mScore { TH_SCORE, 0, 9999999990, 10, 100000000 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mLife { TH_LIFE, 0, 7 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mLifeFragment { TH_LIFE_FRAGMENT, 0, 2 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mBomb { TH_BOMB, 0, 7 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mBombFragment { TH_BOMB_FRAGMENT, 0, 2 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mPower { TH_POWER, 100, 400 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mValue { TH_VALUE, 0, 1000000 };

        Gui::GuiCheckBox mHyperActive { TH20_HYPER_ACTIVE };
        Gui::GuiCheckBox mStoneActive { TH20_STONE_ACTIVE };
        Gui::GuiSlider<int, ImGuiDataType_S32> mHyper { TH20_HYPER, 0, 10000, 1, 1000 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mStone { TH20_STONE_GAUGE, 0, 10000, 1, 1000 };
        Gui::GuiSlider<int, ImGuiDataType_S32> mStoneSummoned { TH20_STONE_SUMMONED, 0, 26 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mLevelR { TH20_STONE_LEVEL_R, 1, 5 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mPriorityR { TH20_STONE_PRIORITY_R, 0, 1000 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mLevelB { TH20_STONE_LEVEL_B, 1, 5 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mPriorityB { TH20_STONE_PRIORITY_B, 0, 1000 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mLevelY { TH20_STONE_LEVEL_Y, 1, 5 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mPriorityY { TH20_STONE_PRIORITY_Y, 0, 1000 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mLevelG { TH20_STONE_LEVEL_G, 1, 5 };
        Gui::GuiSlider<int32_t, ImGuiDataType_S32> mPriorityG { TH20_STONE_PRIORITY_G, 0, 1000 };

        int mChapterSetup[7][2] {
            { 3, 2 },
            { 3, 3 },
            { 4, 3 },
            { 5, 2 },
            { 5, 2 },
            { 4, 1 },
            { 4, 3 },
        };

        int mDiffculty = 0;
    };
    class THGuiRep : public Gui::GameGuiWnd {
        THGuiRep() noexcept
        {
            wchar_t appdata[MAX_PATH];
            GetEnvironmentVariableW(L"APPDATA", appdata, MAX_PATH);
            mAppdataPath = appdata;
        }
        SINGLETON(THGuiRep);

    public:
        THPracParam mRepParam;
        bool mRepSelected = false;
        uint32_t mSelectedRepStartStage;
        uint32_t mSelectedRepEndStage;
        std::wstring mSelectedRepName;
        std::wstring mSelectedRepDir;
        std::wstring mSelectedRepPath;

        void CheckReplay()
        {
            uint32_t rep_offset = GetMemContent(RVA(MAIN_MENU_PTR), 0x5738) * 0x4 + 0x5740;
            std::wstring repName = mb_to_utf16(GetMemAddr<char*>(RVA(MAIN_MENU_PTR), rep_offset, 0x260), 932);
            std::wstring repDir(mAppdataPath);
            repDir.append(L"\\ShanghaiAlice\\th20\\replay\\");

            mSelectedRepName = repName;
            mSelectedRepDir = repDir;
            if (mSelectedRepPath != repDir + repName) {
                mSelectedRepPath = repDir + repName;
                ResetFixToolsSharedState();
            }

            std::string param;
            if (ReplayLoadParam(mSelectedRepPath.c_str(), param) && mRepParam.ReadJson(param))
                mParamStatus = true;
            else
                mRepParam.Reset();

            uint32_t* savedStones = (uint32_t*)GetMemAddr(RVA(MAIN_MENU_PTR), rep_offset, 0x1C, 0xDC);
            memcpy(replayStones, savedStones, sizeof(replayStones));

            for (int st = 1; st <= 7; ++st) {
                if (GetMemContent(RVA(MAIN_MENU_PTR), rep_offset, 0xf8 + 0x2c * st)) {
                    if (!mSelectedRepStartStage) mSelectedRepStartStage = st;
                    mSelectedRepEndStage = st;
                }
            }
        }

        bool mRepStatus = false;
        void State(int state)
        {
            switch (state) {
            case 1:
                mRepStatus = false;
                mParamStatus = false;
                mRepSelected = false;
                mSelectedRepStartStage = 0;
                mSelectedRepEndStage = 0;

                if (advFixTimerOffsets && thPracParam.HasTransitionSyncData())
                    repFixParamCopy = thPracParam;
                thPracParam.Reset();
                break;
            case 2:
                CheckReplay();
                mRepSelected = true;
                break;
            case 3:
                mRepStatus = true;
                if (mParamStatus)
                    memcpy(&thPracParam, &mRepParam, sizeof(THPracParam));

                if (advExtraFixResOpt && !thPracParam.resolutionSpriteHeight)
                    thPracParam.resolutionSpriteHeight = defaultSpriteHeights[advExtraFixResOpt];

                if (advFixTimerOffsets && repFixParamCopy.HasTransitionSyncData())
                    thPracParam = repFixParamCopy;
                break;
            default:
                break;
            }
        }

    protected:
        std::wstring mAppdataPath;
        bool mParamStatus = false;
    };
    class THOverlay : public Gui::GameGuiWnd {
        THOverlay() noexcept
        {
            SetTitle("Mod Menu");
            SetFade(0.5f, 0.5f);
            SetPos(10.0f, 10.0f);
            SetSize(0.0f, 0.0f);
            SetWndFlag(
                ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove | ImGuiWindowFlags_AlwaysAutoResize | ImGuiWindowFlags_NoSavedSettings | ImGuiWindowFlags_NoFocusOnAppearing | ImGuiWindowFlags_NoNav | 0);
            OnLocaleChange();
        }
        SINGLETON(THOverlay);

    public:
        HOTKEY_DEFINE(mHyperGLock, TH20_HYP_LOCK, "F5", VK_F5)
        PATCH_HK(0x133935, NOP(3)),
        PATCH_HK(0x12FE5B, NOP(19)),
        PATCH_HK(0x1309A9, NOP(19)),
        PATCH_HK(0x1313DF, NOP(19)),
        PATCH_HK(0x1319C7, NOP(19)),
        PATCH_HK(0x131FFF, NOP(19)),
        PATCH_HK(0x1352EB, NOP(19)),
        PATCH_HK(0x13858B, NOP(19)),
        PATCH_HK(0x13652C, NOP(25)),
        PATCH_HK(0x1379DC, NOP(25))
        HOTKEY_ENDDEF();
    protected:
        virtual void OnLocaleChange() override
        {
            float x_offset_1 = 0.0f;
            float x_offset_2 = 0.0f;
            switch (Gui::LocaleGet()) {
            case Gui::LOCALE_ZH_CN:
                x_offset_1 = 0.1f;
                x_offset_2 = 0.14f;
                break;
            case Gui::LOCALE_EN_US:
                x_offset_1 = 0.1f;
                x_offset_2 = 0.14f;
                break;
            case Gui::LOCALE_JA_JP:
                x_offset_1 = 0.1f;
                x_offset_2 = 0.14f;
                break;
            default:
                break;
            }

            mMenu.SetTextOffsetRel(x_offset_1, x_offset_2);
            mMuteki.SetTextOffsetRel(x_offset_1, x_offset_2);
            mInfLives.SetTextOffsetRel(x_offset_1, x_offset_2);
            mInfBombs.SetTextOffsetRel(x_offset_1, x_offset_2);
            mInfPower.SetTextOffsetRel(x_offset_1, x_offset_2);
            mHyperGLock.SetTextOffsetRel(x_offset_1, x_offset_2);
            mWonderStGLock.SetTextOffsetRel(x_offset_1, x_offset_2);
            mTimeLock.SetTextOffsetRel(x_offset_1, x_offset_2);
            mAutoBomb.SetTextOffsetRel(x_offset_1, x_offset_2);
            mElBgm.SetTextOffsetRel(x_offset_1, x_offset_2);
        }
        virtual void OnContentUpdate() override
        {
            mMuteki();
            mInfLives();
            mInfBombs();
            mInfPower();
            mHyperGLock();
            mWonderStGLock();
            mTimeLock();
            mAutoBomb();
            mElBgm();
        }
        virtual void OnPreUpdate() override
        {
            if (mMenu(false) && !ImGui::IsAnyItemActive()) {
                if (*mMenu) {
                    Open();
                } else {
                    Close();
                }
            }
        }

        Gui::GuiHotKeyChord mMenu { "ModMenuToggle", "BACKSPACE", Gui::GetBackspaceMenuChord() };

        HOTKEY_DEFINE(mMuteki, TH_MUTEKI, "F1", VK_F1)
        PATCH_HK(0xF87FC, "01"),
        PATCH_HK(0xF8734, "EB")
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mInfLives, TH_INFLIVES, "F2", VK_F2)
        PATCH_HK(0xF849D, "00")
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mInfBombs, TH_INFBOMBS, "F3", VK_F3)
        PATCH_HK(0xE1722, "0F1F00")
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mInfPower, TH_INFPOWER, "F4", VK_F4)
        PATCH_HK(0xE16A2, NOP(3)) //0xE16A8
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mWonderStGLock, TH20_WST_LOCK, "F6", VK_F6)
        PATCH_HK(0x77F75, NOP(3)),
        PATCH_HK(0x1127AC, "E9AA000000CCCC"),
        PATCH_HK(0x112AA0 , "C3CCCC")
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mTimeLock, TH_TIMELOCK, "F7", VK_F7)
        PATCH_HK(0x86FDD, "EB"),
        PATCH_HK(0xA871E, "31")
        HOTKEY_ENDDEF();

        HOTKEY_DEFINE(mAutoBomb, TH_AUTOBOMB, "F8", VK_F8)
        PATCH_HK(0xF79AC, "0F"),
        PATCH_HK(0xF79B3, "0F")
        HOTKEY_ENDDEF();
    public:
        Gui::GuiHotKey mElBgm { TH_EL_BGM, "F9", VK_F9 };
    };

    // TODO(?)
    //static constinit HookCtx listIterUnlinkFix = { .addr = 0x11AB2, .data = PatchCode("e800000000") };
    EHOOK_ST(th20_piv_overflow_fix, 0xC496B, 2, {
        uintptr_t stats = RVA(0x1BA5F0);
        int32_t piv = *(int32_t*)(stats + 0x44);
        int32_t piv_base = *(int32_t*)(stats + 0x40); // always 10000?
        int32_t piv_divisor = *(int32_t*)(stats + 0x48); // always 5000?

        int32_t half_piv_base = piv_base / 2;
        int64_t uh_oh = (int64_t)piv_base * piv;
        pCtx->Esi = (int32_t)(uh_oh / piv_divisor) + half_piv_base;
        pCtx->Eip = RVA(0xC49C4);
    });
    PATCH_ST(th20_piv_uncap_1, 0xA9FE5, "89D00F1F00");
    PATCH_ST(th20_piv_uncap_2, 0xB82E6, "89D00F1F00");
    PATCH_ST(th20_score_uncap, 0xE14F2, "EB");
    EHOOK_ST(th20_score_uncap_stage_tr, 0x10910F, 2, {
        pCtx->Esi += 8;
        pCtx->Edi += 8;
        pCtx->Ecx -= 2;
    });
    PATCH_ST(th20_infinite_stones, 0x11784B, "EB");
    PATCH_ST(th20_hitbox_scale_fix, 0xFF490, "B864000000C3");

    EHOOK_ST(th20_cleanup_stone_active, 0x11269f, 1, {
        // to make stoneActive work, we set the meter to max in init, let the game do its thing & adjust the meter/timer to the specified value
        uintptr_t game_side = RVA(GAME_SIDE0);
        uintptr_t player_stats = game_side + 0x88;
        *(int32_t*)(player_stats + 0x5C) = thPracParam.stone * thPracParam.stoneMax;

        uintptr_t enemy_stone_manager = *(uintptr_t*)RVA(ENM_STONE_MGR_PTR);
        Timer20* stone_interp_timer = (Timer20*)(enemy_stone_manager + 0x84 + 0x14);

        //stone_interp_timer->cur = 1320 - (1320 * thPracParam.stone);                         // option A: duration-accurate (50% stone = 50% of the duration)
        stone_interp_timer->cur = 1320.0f * (1.0f - cbrtf(fmaxf(0.0001f, thPracParam.stone))); // option B: visuals-accurate (the drain meter is cubicly interpolated) (dont let it be 0) (just dont)
        stone_interp_timer->cur_f = (float)stone_interp_timer->cur;

        th20_cleanup_stone_active.Toggle(false);
    });

    class THAdvOptWnd : public Gui::PPGuiWnd {
        SINGLETON(THAdvOptWnd);

    public:
    private:
    private:
        bool pivOverflowFix = false;
        bool pivUncap = false;
        bool scoreUncap = false;
        bool infiniteStones = false;
        bool plHitboxScaleFix = false;

        void MasterDisableInit()
        {
        }
        void FpsInit()
        {
            mOptCtx.fps_dbl = 60.0;

            if (*(uint8_t*)RVA(0x1C4F89) == 3) {
                mOptCtx.fps_status = 1;

                DWORD oldProtect;
                VirtualProtect((void*)RVA(0x19EAF), 4, PAGE_EXECUTE_READWRITE, &oldProtect);
                *(double**)RVA(0x19EAF) = &mOptCtx.fps_dbl;
                VirtualProtect((void*)RVA(0x19EAF), 4, oldProtect, &oldProtect);
            } else
                mOptCtx.fps_status = 0;
        }
        void FpsSet()
        {
            if (mOptCtx.fps_status == 1) {
                mOptCtx.fps_dbl = (double)mOptCtx.fps;
            }
        }
        void GameplayInit()
        {
        }
        void GameplaySet()
        {
        }

        // From zero318
        struct ZUNListIter;
        struct ZUNListIterable;

        struct ZUNList {
            void* data; // 0x0
            ZUNList* next; // 0x4
            ZUNList* prev; // 0x8
            ZUNListIterable* list; // 0xC
            ZUNListIter* current_iter; // 0x10
        };

        struct ZUNListIter {
            ZUNList* current; // 0x0
            ZUNList* next; // 0x4
        };

        struct ZUNListIterable : ZUNList {
            ZUNList* tail; // 0x14
            ZUNListIter iter; // 0x18
        };

        static void __fastcall UnlinkNodeHook(ZUNListIterable* self, void*, ZUNList* node)
        {
            memset(&self->iter, 0, sizeof(self->iter));
            asm_call_rel<0x11AD0, Thiscall>(self, node);
        }

        THAdvOptWnd() noexcept
        {
            SetWndFlag(ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoCollapse | ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoMove);
            SetFade(0.8f, 0.8f);
            SetStyle(ImGuiStyleVar_WindowRounding, 0.0f);
            SetStyle(ImGuiStyleVar_WindowBorderSize, 0.0f);

            InitUpdFunc([&]() { ContentUpdate(); },
                [&]() { LocaleUpdate(); },
                [&]() {},
                []() {});

            OnLocaleChange();
            FpsInit();
            GameplayInit();
            MasterDisableInit();

            th20_piv_overflow_fix.Setup();
            th20_piv_uncap_1.Setup();
            th20_piv_uncap_2.Setup();
